Description: Downloads the latest version of the Pharos Popup client.
Identifier: com.github.mlbz521.download.PharosPopupClient
MinimumVersion: "2.3"
Input:
  NAME: Pharos Popup Client
  DOWNLOAD_PAGE: https://community.pharos.com/s/article/Macintosh-Updates-For-Uniprint
  DOWNLOAD_URL_PREFIX: https://private.filesanywhere.com/PHAROS/
  WEB_DRIVER: Chrome
  WEB_DRIVER_PATH: /Library/AutoPkg/chromedriver
  WEB_DRIVER_BINARY_LOCATION: /Applications/Chromium.app/Contents/MacOS/Chromium
Process:
  - Processor: PharosURLProvider
    Arguments:
      downloads_page: "%DOWNLOAD_PAGE%"
      prefix_dl_url: "%DOWNLOAD_URL_PREFIX%"
      web_driver: "%WEB_DRIVER%"
      web_driver_path: "%WEB_DRIVER_PATH%"
      web_driver_binary_location: "%WEB_DRIVER_BINARY_LOCATION%"
  - Processor: EndOfCheckPhase
  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzipped"
      purge_destination: true
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/unzipped/Popup.dmg/Popup.pkg"
      expected_authority_names:
        - "Developer ID Installer: Pharos Systems International (QMY9322U6D)"
        - Developer ID Certification Authority
        - Apple Root CA
