Description:
  Downloads the latest Pharos Popup client disk image and copies out the pkg
  within, appending the version number to the filename.
Identifier: com.github.mlbz521.pkg.PharosPopupClient
ParentRecipe: com.github.mlbz521.download.PharosPopupClient
MinimumVersion: "2.3"
Input:
  NAME: Pharos Popup Client
Process:
  - Processor: com.github.mlbz521.SharedProcessors/XarExtractSingleFile
    Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/unzipped/Popup.dmg/Popup.pkg"
      file_to_extract: Distribution
  - Processor: com.github.mlbz521.SharedProcessors/XPathParser
    Arguments:
      xml_file: "%extracted_file%"
      xpath: .//pkg-ref[@id="com.pharos.pkg.popup"]/bundle-version/bundle[@id="com.pharos.popup"]
      attribute_one: CFBundleShortVersionString
      return_variable_attribute_one: version
  - Processor: PkgCopier
    Arguments:
      source_pkg: "%RECIPE_CACHE_DIR%/unzipped/Popup.dmg/Popup.pkg"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unzipped"
        - "%RECIPE_CACHE_DIR%/extractedfile"
