<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Pharos Popup client and copies out the flat installer pkg
within, appending the version number to the filename.

Originally created by @asemak (asemak-recipes).</string>
        <key>Identifier</key>
        <string>com.github.mlbz521.pkg.PharosPopupClient</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Pharos Popup Client</string>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.mlbz521.download.PharosPopupClient</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%RECIPE_CACHE_DIR%/unzipped/%DOWNLOAD_PREFIX% %version%/Popup.dmg/Popup.pkg</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>