<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.RealVNCViewer</string>
	<key>Input</key>
	<dict>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>
		<key>NAME</key>
		<string>RealVNC Viewer</string>
		<key>CATEGORY</key>
		<string>Utilities</string>
		<key>DESCRIPTION</key>
		<string>VNC Viewer allows you to connect to and control another system that is running a VNC Server session.

VNC, virtual network computing, is a desktop sharing system that allows you to remotely control another computer.  VNC works by transmitting all of your keyboard and mouse movements from one device to another.</string>
		<key>ICON</key>
		<string>RealVNC Viewer.png</string>
		<key>os_requirements</key>
		<string>10.15.x,10.14.x,10.13.x,10.12.x,10.11.x,10.10.x</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.RealVNCViewer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_icon</key>
				<string>%ICON%</string>
				<key>self_service_description</key>
				<string>%DESCRIPTION%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
