<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the Amazon Corretto OpenJDK.  The JDK Major Version can be specified using the override variable "JDK_MAJOR_VERSION".

Currently available from Amazon are the 8 and 11 JDKs.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.download.AmazonCorrettoOpenJDK</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Amazon Corretto JDK</string>
		<key>JDK_MAJOR_VERSION</key>
		<string>8</string>
		<key>DOWNLOAD_URL</key>
		<string>https://corretto.aws/downloads/latest/amazon-corretto-%JDK_MAJOR_VERSION%-x64-macos-jdk.tar.gz</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>