<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ARCHICAD from a local file share, builds a package, and uploads it to the JSS.

You can provide values for eduSerialNumber and eduUserID as well to license the install.

Please note, there is likely a newer 'patch' available.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.ARCHICAD</string>
	<key>Input</key>
	<dict>
		<key>CUSTOM_TRIGGER</key>
		<string>ARCHICAD_#MAJOR_VERSION#</string>
		<key>GROUP_TEMPLATE</key>
		<string>GroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>

		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>

		<key>NAME</key>
		<string>ARCHICAD</string>
		<key>CATEGORY</key>
		<string>Testing</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>ARCHICAD is a tool for architects working in the architecture-engineering-construction (AEC) industry for designing buildings from the conceptual phase all through to construction phase.

It is a BIM software developed by GRAPHISOFT enabling architects to work in a BIM (Building Information Modeling/Management) environment.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>ARCHICAD 25.png</string>

		<key>SEARCH_STRING</key>
		<string>ARCHICAD</string>
		<key>MAJOR_VERSION</key>
		<string></string>
		<key>NAME_LIMITATION</key>
		<string></string>
		<key>NAME_EXCEPTION</key>
		<string></string>
		<key>FILE_SHARE</key>
		<string>/path/to/offline/repository</string>
		<key>VERSION_STRING_SEPARATOR</key>
		<string>-</string>
		<key>MAX_FOLDER_DEPTH</key>
		<string>1</string>
		<key>EDUSERIALNUMBER</key>
		<string></string>
		<key>EDUUSERID</key>
		<string></string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.ARCHICAD</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>original_string</key>
				<string>%CUSTOM_TRIGGER%</string>
				<key>return_variable</key>
				<string>CUSTOM_TRIGGER</string>
				<key>string_to_replace</key>
				<string>#MAJOR_VERSION#</string>
				<key>variable_to_use</key>
				<string>found_major_version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>original_string</key>
				<string>%NAME%</string>
				<key>return_variable</key>
				<string>NAME</string>
				<key>string_to_replace</key>
				<string>$</string>
				<key>variable_to_use</key>
				<string>found_major_version</string>
				<key>append_space</key>
				<true />
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>