<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest updated build of ARCHICAD based on the override-able parameters:  major_version, localization, and release_type.  The builds a package and uploads it to the JSS.

MAJOR_VERSION tested options are:  20, 21, 22, 23, 24, 25 (newer are expected to work)
LOCALIZATION options include:  INT (international english, part of many other licenses), AUS, AUT, BRA, CHE, CHI, CZE, FIN, FRA, GER, GRE, HUN, ITA, JPN, KOR, NED, NOR, NZE, POL, POR, RUS, SPA, SWE, TAI, TUR, UKI, UKR, and USA
RELEASE_TYPE options include:  FULL, SOLO, and START</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.ARCHICADPatch</string>
	<key>Input</key>
	<dict>
		<key>CUSTOM_TRIGGER</key>
		<string>ARCHICAD_#MAJOR_VERSION#_Patch</string>
		<key>GROUP_TEMPLATE</key>
		<string>GroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>
		<key>package_priority</key>
		<string>12</string>

		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>

		<key>NAME</key>
		<string>ARCHICAD Patch</string>
		<key>CATEGORY</key>
		<string>Testing</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>This will update your current version of ARCHICAD to the latest version.

ARCHICAD is a tool for architects working in the architecture-engineering-construction (AEC) industry for designing buildings from the conceptual phase all through to construction phase.

It is a BIM software developed by GRAPHISOFT enabling architects to work in a BIM (Building Information Modeling/Management) environment.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>ARCHICAD 25.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.ARCHICADPatch</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>original_string</key>
				<string>%CUSTOM_TRIGGER%</string>
				<key>return_variable</key>
				<string>CUSTOM_TRIGGER</string>
				<key>string_to_replace</key>
				<string>#MAJOR_VERSION#</string>
				<key>variable_to_use</key>
				<string>MAJOR_VERSION</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>original_string</key>
				<string>%NAME%</string>
				<key>return_variable</key>
				<string>NAME</string>
				<key>string_to_replace</key>
				<string>Patch</string>
				<key>variable_to_use</key>
				<string>MAJOR_VERSION</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>original_string</key>
				<string>%NAME%</string>
				<key>return_variable</key>
				<string>NAME</string>
				<key>string_to_replace</key>
				<string>$</string>
				<key>replacement_string</key>
				<string>Patch</string>
				<key>append_space</key>
				<true />
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>