<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Android Studio Command Line Tools (sdkmanager) from Google.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.download.AndroidStudioSDKCLITools</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Android Studio SDK CLI Tools</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;download_url&gt;https\://dl\.google\.com/android/repository/(?P&lt;filename&gt;commandlinetools-mac-\d+_latest\.zip))</string>
		<key>SEARCH_URL</key>
		<string>https://developer.android.com/studio</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%filename%</string>
				<key>url</key>
				<string>%download_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>