<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of Cisco Umbrella Roaming Client.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.download.CiscoUmbrellaRoamingClient</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Cisco Umbrella Roaming Client</string>
		<!-- <key>DOWNLOAD_URL</key>
		<string>https://shared.opendns.com/roaming/enterprise/release/mac/stage/RoamingClient_MAC.mpkg.zip</string> -->
		<!-- 
			Old URL has been changed to:  https://cisco-umbrella-client-downloads.s3.amazonaws.com/mac/production/RoamingClient_MAC.mpkg.zip 
			Found here:  https://support.umbrella.com/hc/en-us/articles/231356108-Roaming-Client-Deployment-Parameters-for-Mass-Deployment-MSP-
			However, went ahead and improved the recipe as the above URL still doesn't download the *actual* latest version; always seems to be n-1.
			Leaving this here for future notes/reference/just in case.
		-->
		<key>BASE_URL</key>
		<string>https://support.umbrella.com</string>
		<key>SEARCH_URL</key>
		<string>%BASE_URL%/hc/en-us/sections/4404390256788-MacOS</string>
		<key>SEARCH_PATTERN_1</key>
		<string>/hc/en\-us/articles/\d+\-(?:Umbrella\-)?Roaming\-Client\-for\-[Mm]acOS\-(?:Version\-)?[0-9\-]+</string>
		<key>SEARCH_PATTERN_2</key>
		<string>(?P&lt;download_url&gt;https://disthost.umbrella.com/roaming/upgrade/mac/stage/(?P&lt;filename&gt;RoamingClient_MAC_(?P&lt;version&gt;[0-9\.]+).pkg.zip))</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%SEARCH_URL%</string>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN_1%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%BASE_URL%%match%</string>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN_2%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%download_url%</string>
				<key>filename</key>
				<string>%filename%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: OpenDNS (7P7HQ8H646)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
