<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest verison of JMP from a local file share and then uploads it to a JPS.

The created Policy's name will be in the format of "%NAME% %MAJOR_VERSION%"</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.JMP</string>
	<key>Input</key>
	<dict>
		<key>CUSTOM_TRIGGER</key>
		<string>JMP_Pro_#MAJOR_VERSION#</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>
		<key>NAME</key>
		<string>JMP</string>
		<key>NAME_EXCEPTION</key>
		<string>Pro</string>
		<key>CATEGORY</key>
		<string>Analytics</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Data analysis software that is tool of choice for hundreds of thousands of scientists, engineers and other data explorers worldwide. Users leverage powerful statistical and analytic capabilities in JMP to discover the unexpected.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>JMP.png</string>
		<key>STRING_TO_REPLACE</key>
		<string>$</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.JMP</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>original_string</key>
				<string>%CUSTOM_TRIGGER%</string>
				<key>return_variable</key>
				<string>CUSTOM_TRIGGER</string>
				<key>string_to_replace</key>
				<string>#MAJOR_VERSION#</string>
				<key>variable_to_use</key>
				<string>found_major_version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>original_string</key>
				<string>%NAME%</string>
				<key>return_variable</key>
				<string>PKG_NAME</string>
				<key>string_to_replace</key>
				<string>JMP</string>
				<key>replacement_string</key>
				<string>JMP</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>original_string</key>
				<string>%NAME%</string>
				<key>return_variable</key>
				<string>NAME</string>
				<key>string_to_replace</key>
				<string>%STRING_TO_REPLACE%</string>
				<key>variable_to_use</key>
				<string>found_major_version</string>
				<key>append_space</key>
				<true />
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
