<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest verison of JMP/JMP Pro from a local file share.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.pkg.JMP</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>JMP</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.JMP</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/extract</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/extract/JMP*.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/XPathParser</string>
			<key>Arguments</key>
			<dict>
				<key>xml_file</key>
				<string>%found_filename%/PackageInfo</string>
				<key>xpath</key>
				<string>.//bundle-version/bundle</string>
				<key>attribute_one</key>
				<string>CFBundleShortVersionString</string>
				<key>return_variable_attribute_one</key>
				<string>version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/RenamePath</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>new_name</key>
				<string>%NAME%-%version%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/extract</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
