Description: |
  Downloads and packages the latest version of Maple.

  You must override the following keys:
    * MAPLE_PURCHASE_CODE
      * Your Maple Purchase Code that is emailed to you
    * INSTALL_TYPE
      * dmg (macOS)
      * exe (Windows)
      * run (Linux)
      * (Other install types are included as an example as they could be supported, but this recipe obviously does not.)
Identifier: com.github.mlbz521.pkg.Maple
ParentRecipe: com.github.mlbz521.download.Maple
MinimumVersion: '2.3'
Input:
  NAME: Maple
  MAPLE_PURCHASE_CODE: <your Maple Purchase Code>
  INSTALL_TYPE: dmg
  PKG_NAME: 'Maple #MAJOR_VERSION#'
  BUNDLE_ID: com.maplesoft.maple#MAJOR_VERSION#
Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgdirs: {}
  - Processor: Copier
    Arguments:
      source_path: '%pathname%/*.app'
      destination_path: '%RECIPE_CACHE_DIR%/scripts/%app_name%'
      overwrite: true
  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/scripts/preinstall'
      file_mode: '0755'
      file_content: |
        #!/bin/bash

        ###################################################################################################
        # Script Name:  install_Maple.sh
        # By:  Zack Thompson / Created:  3/2/2017
        # Version:  1.5.1 / Updated:  3/30/2018 / By:  ZT
        #
        # Description:  This script silently installs Maple.
        #
        ###################################################################################################

        echo "*****  Install Maple process:  START  *****"

        ##################################################
        # Define Variables

        # Set working directory
        pkgDir=$( /usr/bin/dirname "${0}" )
        # Get the filename of the .dmg file
        app=$( /bin/ls "${pkgDir}" | /usr/bin/grep .app )

        ##################################################
        # Bits staged...

        # Install Maple
        echo "Installing Maple..."
        exitStatus=$( "${pkgDir}/${app}/Contents/MacOS/installbuilder.sh" --mode unattended )
        exitCode=$?

        if [[ $exitCode != 0 ]]; then
          echo "ERROR:  Install failed!"
          echo "Exit Code:  ${exitCode}"
          echo "Exit status was:  ${exitStatus}"
          echo "*****  Install Maple process:  FAILED  *****"
          exit 1
        fi

        echo "Install complete!"
        echo "*****  Install Maple process:  COMPLETE  *****"

        exit 0
  - Processor: com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter
    Arguments:
      original_string: '%BUNDLE_ID%'
      return_variable: BUNDLE_ID
      string_to_replace: '#MAJOR_VERSION#'
      variable_to_use: major_version
  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: '%BUNDLE_ID%'
        options: purge_ds_store
        pkgname: '%NAME%-%installed_version%'
        pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
        pkgtype: flat
        scripts: '%RECIPE_CACHE_DIR%/scripts'
        version: '%installed_version%'
  - Processor: com.github.mlbz521.SharedProcessors/StringRightSplitter
    Arguments:
      string_to_split: '%version%'
      split_on: .
      occurrence: 3
      index: 0
      return_variable: major_version
  - Processor: com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter
    Arguments:
      original_string: '%PKG_NAME%'
      return_variable: PKG_NAME
      string_to_replace: '#MAJOR_VERSION#'
      variable_to_use: major_version
  - Processor: com.github.mlbz521.SharedProcessors/RenamePath
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/%NAME%-%installed_version%.pkg'
      new_name: '%RECIPE_CACHE_DIR%/%PKG_NAME%-%installed_version%.pkg'
  - Processor: PathDeleter
    Arguments:
      path_list: 
        - '%RECIPE_CACHE_DIR%/pkgroot'
        - '%RECIPE_CACHE_DIR%/scripts'
