<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads and packages the latest verison of Maple from a local file share.

This creates a preinstall script to uninstall previous versions.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.pkg.Maple</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Maple</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.Maple</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%found_filename%/*.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%cached_path%/*.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%found_filename%/%dmg_found_filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/%dmg_found_filename%</string>
                <key>overwrite</key>
                <true/>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
				<key>file_content</key>
				<string>#! /bin/bash

###################################################################################################
# Script Name:  uninstall_Maple.sh
# By:  Zack Thompson / Created:  3/26/2020
# Version:  1.0.0 / Updated:  3/26/2020 / By:  ZT
#
# Description:  Remove previous version(s) of Maple from /Applications
#
###################################################################################################

echo "*****  Uninstall Maple process:  START  *****"

echo "Searching for existing Maple instances..."
appPaths=$( /usr/bin/find -E /Applications -iregex ".*[/]Maple [0-9]{4}[.]app" -type d -prune -maxdepth 1 )

# Verify that a Maple version was found.
if [[ -z "${appPaths}" ]]; then
	echo "Did not find an instance Maple!"

else
	# If the machine has multiple Maple Applications, loop through them...
	while IFS="\n" read -r appPath; do

		# Get the App Bundle name
		appName=$( echo "${appPath}" | /usr/bin/awk -F "/" '{print $NF}' )

		# Delete the old version
		echo "Uninstalling:  ${appName}"
		/bin/rm -rf "${appPath}"

	done &lt; &lt;(echo "${appPaths}")
fi

echo "*****  Uninstall Maple process:  COMPLETE  *****"

exit 0</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/scripts/preinstall</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
				<key>file_content</key>
				<string>#!/bin/bash

###################################################################################################
# Script Name:  install_Maple.sh
# By:  Zack Thompson / Created:  3/2/2017
# Version:  1.5.1 / Updated:  3/30/2018 / By:  ZT
#
# Description:  This script silently installs Maple.
#
###################################################################################################

echo "*****  Install Maple process:  START  *****"

##################################################
# Define Variables

# Set working directory
pkgDir=$( /usr/bin/dirname "${0}" )
# Get the filename of the .dmg file
app=$( /bin/ls "${pkgDir}" | /usr/bin/grep .app )

##################################################
# Bits staged...

# Install Maple
echo "Installing Maple..."
exitStatus=$( "${pkgDir}/${app}/Contents/MacOS/installbuilder.sh" --mode unattended )
exitCode=$?

if [[ $exitCode != 0 ]]; then
	echo "ERROR:  Install failed!"
	echo "Exit Code:  ${exitCode}"
	echo "Exit status was:  ${exitStatus}"
	echo "*****  Install Maple process:  FAILED  *****"
	exit 1
fi

echo "Install complete!"
echo "*****  Install Maple process:  COMPLETE  *****"

exit 0</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>version</key>
					<string>%version%</string>
					<key>id</key>
					<string>com.bitrock.appinstaller</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>scripts</key>
					<string>Scripts</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
