<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Maple from a local file share.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.download.offline.Maple</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Maple</string>
		<key>SEARCH_STRING</key>
		<string>Maple</string>
		<key>MAJOR_VERSION</key>
		<string></string>
		<key>NAME_LIMITATION</key>
		<string></string>
		<key>NAME_EXCEPTION</key>
		<string>Patch</string>
		<key>FILE_SHARE</key>
		<string>/path/to/offline/repository</string>
		<key>VERSION_STRING_SEPARATOR</key>
		<string>-</string>
		<key>MAX_FOLDER_DEPTH</key>
		<string>1</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/OfflineApps</string>
			<key>Arguments</key>
			<dict>
				<key>search_path</key>
				<string>%FILE_SHARE%</string>
				<key>search_string</key>
				<string>%SEARCH_STRING%</string>
				<key>major_version</key>
				<string>%MAJOR_VERSION%</string>
				<key>exception_string</key>
				<string>%NAME_EXCEPTION%</string>
				<key>limitation_string</key>
				<string>%NAME_LIMITATION%</string>
				<key>version_separator</key>
				<string>%VERSION_STRING_SEPARATOR%</string>
				<key>max_depth</key>
				<string>%MAX_FOLDER_DEPTH%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/StringRightSplitter</string>
			<key>Arguments</key>
			<dict>
				<key>string_to_split</key>
				<string>%version%</string>
				<key>split_on</key>
				<string>.</string>
				<key>occurrence</key>
				<integer>3</integer>
				<key>index</key>
				<integer>0</integer>
				<key>return_variable</key>
				<string>major_version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%cached_path%/*.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%found_filename%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.installbuilder.appinstaller" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = NZQTWY25Y5</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
