<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.mlbz521.jss.MaplePatch</string>
    <key>Description</key>
    <string>Downloads the patch for the specified Maple major version.

Specify major version as:  '2019', '2018', '2017', or 2016</string>
    <key>Input</key>
	<dict>
		<key>GROUP_TEMPLATE</key>
		<string>GroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>
		<key>package_priority</key>
		<string>12</string>

		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>

		<key>CATEGORY</key>
		<string>Mathematics</string>

        <key>MAJOR_VERSION</key>
        <string>2019</string>
        <key>NAME</key>
        <string>Maple %MAJOR_VERSION% Patch</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Maple is math software that combines the world's most powerful math engine with an interface that makes it extremely easy to analyze, explore, visualize, and solve mathematical problems.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Maple.png</string>
		<!-- A 7z-compatible binary is required.  If one in not in your system PATH 
		or in a standard location, you will need to specify the location here. -->
		<key>BINARY_7Z_PATH</key>
		<string>/path/to/7z</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.MaplePatch</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>