Description: |
  Downloads the latest or specified version of Python.  Stable builds are checked first, then pre-release builds.
  Options:
    * To download the latest version of Python, use (this is REGEX):  \d+
    * To download a specific minor version, for example, you can use:  "10" or "3.10"
    * You can download a pre-release build if the minor version does not yet have a stable release
    * Technically, you can even download Python2 if you wanted; e.g.:  "2.7"

  The recipe will also set the env variable `version_major_minor` that can be used in child recipes.

  This recipe defers from the Python3 recipe in scriptingosx-recipes repo by allowing the version to be specified.
Identifier: com.github.mlbz521.download.Python-Version
MinimumVersion: "2.3"
Input:
  NAME: Python
  MATCH_VERSION: \d+
Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<url>https://.*/python-(?P<version>(\d.)?%MATCH_VERSION%\.[\d]+).*\.pkg)
      url: https://www.python.org/downloads/macos/
  - Processor: com.github.mlbz521.SharedProcessors/VersionMajorMinor
    Arguments:
      version: "%version%"
  - Processor: URLDownloader
  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: Python Software Foundation (BMM5U3QVKW)"
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: "%pathname%"
  - Processor: EndOfCheckPhase
