<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.mlbz521.pkg.GoogleDriveFileStream</string>
	<key>Description</key>
	<string>Downloads the latest version of Drive File Stream and creates a package.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Google Drive File Stream</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.wardsparadox.download.googledrivefs</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%/*.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
