<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Mathematica from a local file share.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.download.Mathematica</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mathematica</string>
		<key>SEARCH_STRING</key>
		<string>Mathematica</string>
		<key>MAJOR_VERSION</key>
		<string></string>
		<key>NAME_LIMITATION</key>
		<string></string>
		<key>NAME_EXCEPTION</key>
		<string>Patch</string>
		<key>FILE_SHARE</key>
		<string>/Volumes/Jamf Pro</string>
        <key>VERSION_STRING_SEPARATOR</key>
        <string>-</string>
		<key>MAX_FOLDER_DEPTH</key>
		<string>1</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>com.github.mlbz521.SharedProcessors/OfflineApps</string>
            <key>Arguments</key>
            <dict>
                <key>search_path</key>
                <string>%FILE_SHARE%</string>
                <key>search_string</key>
                <string>%SEARCH_STRING%</string>
                <key>major_version</key>
                <string>%MAJOR_VERSION%</string>
                <key>exception_string</key>
                <string>%NAME_EXCEPTION%</string>
                <key>limitation_string</key>
                <string>%NAME_LIMITATION%</string>
                <key>version_separator</key>
                <string>%VERSION_STRING_SEPARATOR%</string>
                <key>max_depth</key>
                <string>%MAX_FOLDER_DEPTH%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%cached_path%/*.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%found_filename%/*.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%cached_path%/*.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%found_filename%/%dmg_found_filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/%dmg_found_filename%</string>
                <key>overwrite</key>
                <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%found_filename%/*.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%cached_path%/*.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%found_filename%/%dmg_found_filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/%dmg_found_filename%</string>
                <key>overwrite</key>
                <true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/scripts/*.app/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%found_filename%</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/*.app</string>
				<key>requirement</key>
				<string>identifier "com.wolfram.Mathematica" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = D2Y8ST33G6</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/*.pkg</string>
				<key>exepected_authority_names</key>
				<array>
					<string>Developer ID Installer: Wolfram Research, Inc (D2Y8ST33G6)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
