Description: |
  Downloads the latest version of MATLAB using the "MATLAB Package Manager" (mpm) CLI utility.
  (See:  https://www.mathworks.com/help/install/ug/get-mpm-os-command-line.html)

  * Note:  As is this recipe downloads both the Intel & ARM MATLAB installer; adjust the below input variables as needed.

  Input Variables:
    * MPM_ARCH = This is for the device running this recipe, use:
      * `maca64` for ARM
      * `maci64` for Intel
    * DL_VERSION = optionally specify version of MATLAB to download, otherwise the latest release will be downloaded
    * DL_PRODUCTS = The MATLAB 'products' to download.  This can include MATLAB, additional products, and support packages.
    * DL_ARCHS = The architecture to download for.  Technically, in addition to macOS Intel/ARM, this can support Windows and Linux as well.
    * INSTALLER_INPUT = A variable file used instead of the `DL_<...>` variables.
        * For additional information, ee:  https://www.mathworks.com/help/install/ug/mpmdownload.html#d126e6114

  For information on how this recipe works, please see the README in my repo (https://github.com/autopkg/MLBZ521-recipes/blob/master/ReadMe.md).
Identifier: com.github.mlbz521.download.MATLAB_MPM
Input:
  NAME: MATLAB
  MPM_ARCH: maca64
  # DL_VERSION: R2025a
  # DL_PRODUCTS:  MATLAB
  # DL_ARCHS: maca64 maci64
  INSTALLER_INPUT: |
    ########################################################################
    ## Configuration File for Installing or Downloading R2025a MathWorks Products
    ########################################################################
    ##
    ## Use this file to configure the installation or download of MathWorks
    ## products and support packages from the command line using the
    ## MATLAB Package Manager (mpm).
    ##
    ## To configure your MATLAB installation or download:
    ##
    ## 1. Set configuration parameters by uncommenting lines that
    ##    start with a single '#' and updating the values. The
    ##    comments above each parameter describe the valid values.
    ##
    ## 2. Run mpm from the command line, using the --inputfile option
    ##    to specify the full path to this configuration file.
    ##
    ##    Install products:
    ##    mpm install --inputfile <full_path_to_this_file>
    ##
    ##    Download products without installing:
    ##    mpm download --inputfile <full_path_to_this_file>
    ##
    ## You can download template input files for all supported releases from
    ## https://github.com/mathworks-ref-arch/matlab-dockerfile/blob/main/MPM.md
    ##
    ########################################################################


    ########################################################################
    ## Platforms
    ########################################################################

    platform.maca64
    platform.maci64

    ########################################################################
    ## RELEASE
    ########################################################################
    ##
    ## By default, mpm gets the latest versions of R2025a MathWorks products
    ## and support packages using this input file.
    ##
    ## To get a specific update for R2025a, set the desired update
    ## number (for example, 1, 2, 3, and so on) and uncomment the following
    ## line. An updateLevel of 0 gets the general release.

    # updateLevel=0


    ########################################################################
    ## INSTALLATION OR DOWNLOAD FOLDER
    ########################################################################
    ##
    ## When installing products using 'mpm install':
    ##
    ##   Specify the full path to the folder where you want to install the
    ##   products. When adding products or support packages to an
    ##   existing MATLAB installation, specify the full path to the folder
    ##   where MATLAB is installed.
    ##
    ##   Example:
    ##   (Linux) destinationFolder=/usr/local/MATLAB/RXXXX
    ##   (Windows) destinationFolder=C:\Program Files\MATLAB\RXXXX
    ##   (Mac) destinationFolder=/Applications/MATLAB_RXXXX.app
    ##
    ## When downloading products using 'mpm download':
    ##
    ##   Specify the full path to the folder where you want to download the
    ##   products. For 'mpm download', this option is required.
    ##
    ##   Example:
    ##   (Linux/Mac) destinationFolder=/home/<USER>/downloads/mathworks
    ##   (Windows) destinationFolder=C:\Users\<USER>\Downloads\MathWorks
    ##
    ## Set the desired value for destinationFolder and
    ## uncomment the following line.

    destinationFolder=#RECIPE_CACHE_DIR#/downloads/installer_content


    ########################################################################
    ## PRODUCTS
    ########################################################################
    ##
    ## Uncomment the lines for the products you want to install or download.

    product.5G_Toolbox
    product.AUTOSAR_Blockset
    product.Aerospace_Blockset
    product.Aerospace_Toolbox
    product.Antenna_Toolbox
    product.Audio_Toolbox
    product.Automated_Driving_Toolbox
    product.Bioinformatics_Toolbox
    product.Bluetooth_Toolbox
    product.Communications_Toolbox
    product.Computer_Vision_Toolbox
    product.Control_System_Toolbox
    product.Curve_Fitting_Toolbox
    product.DDS_Blockset
    product.DSP_HDL_Toolbox
    product.DSP_System_Toolbox
    product.Database_Toolbox
    product.Datafeed_Toolbox
    product.Deep_Learning_Toolbox
    product.Econometrics_Toolbox
    product.Embedded_Coder
    product.Financial_Instruments_Toolbox
    product.Financial_Toolbox
    product.Fixed-Point_Designer
    product.Fuzzy_Logic_Toolbox
    product.Global_Optimization_Toolbox
    product.HDL_Coder
    product.Image_Acquisition_Toolbox
    product.Image_Processing_Toolbox
    product.Industrial_Communication_Toolbox
    product.Instrument_Control_Toolbox
    product.LTE_Toolbox
    product.Lidar_Toolbox
    product.MATLAB
    product.MATLAB_Coder
    product.MATLAB_Compiler
    product.MATLAB_Compiler_SDK
    product.MATLAB_Production_Server
    product.MATLAB_Report_Generator
    product.MATLAB_Test
    product.MATLAB_Web_App_Server
    product.Mapping_Toolbox
    product.Medical_Imaging_Toolbox
    product.Mixed-Signal_Blockset
    product.Model_Predictive_Control_Toolbox
    product.Motor_Control_Blockset
    product.Navigation_Toolbox
    product.Optimization_Toolbox
    product.Parallel_Computing_Toolbox
    product.Partial_Differential_Equation_Toolbox
    product.Phased_Array_System_Toolbox
    product.Polyspace_Bug_Finder
    product.Polyspace_Bug_Finder_Server
    product.Polyspace_Code_Prover
    product.Polyspace_Code_Prover_Server
    product.Polyspace_Test
    product.Powertrain_Blockset
    product.Predictive_Maintenance_Toolbox
    product.RF_Blockset
    product.RF_PCB_Toolbox
    product.RF_Toolbox
    product.ROS_Toolbox
    product.Radar_Toolbox
    product.Reinforcement_Learning_Toolbox
    product.Requirements_Toolbox
    product.Risk_Management_Toolbox
    product.Robotics_System_Toolbox
    product.Robust_Control_Toolbox
    product.Satellite_Communications_Toolbox
    product.Sensor_Fusion_and_Tracking_Toolbox
    product.SerDes_Toolbox
    product.Signal_Processing_Toolbox
    product.SimBiology
    product.SimEvents
    product.Simscape
    product.Simscape_Battery
    product.Simscape_Driveline
    product.Simscape_Electrical
    product.Simscape_Fluids
    product.Simscape_Multibody
    product.Simulink
    product.Simulink_Check
    product.Simulink_Coder
    product.Simulink_Compiler
    product.Simulink_Control_Design
    product.Simulink_Coverage
    product.Simulink_Design_Optimization
    product.Simulink_Design_Verifier
    product.Simulink_Desktop_Real-Time
    product.Simulink_Fault_Analyzer
    product.Simulink_PLC_Coder
    product.Simulink_Report_Generator
    product.Simulink_Test
    product.Stateflow
    product.Statistics_and_Machine_Learning_Toolbox
    product.Symbolic_Math_Toolbox
    product.System_Composer
    product.System_Identification_Toolbox
    product.Text_Analytics_Toolbox
    product.UAV_Toolbox
    product.Vehicle_Dynamics_Blockset
    product.WLAN_Toolbox
    product.Wavelet_Toolbox
    product.Wireless_HDL_Toolbox
    product.Wireless_Testbench


    ########################################################################
    ## SUPPORT PACKAGES
    ########################################################################
    ##
    ## Uncomment the lines for the support packages you want to install or download.

    # product.6G_Exploration_Library_for_5G_Toolbox
    # product.Automated_Driving_Toolbox_Importer_for_Zenrin_Japan_Map_API_3.0_(Itsumo_NAVI_API_3.0)_Service
    # product.Automated_Driving_Toolbox_Test_Suite_for_Euro_NCAP_Protocols
    # product.Automated_Visual_Inspection_Library_for_Computer_Vision_Toolbox
    # product.CI/CD_Automation_for_Simulink_Check
    # product.Communications_Toolbox_Support_Package_for_Analog_Devices_ADALM-Pluto_Radio
    # product.Communications_Toolbox_Support_Package_for_RTL-SDR_Radio
    # product.Communications_Toolbox_Support_Package_for_USRP_Radio
    # product.Communications_Toolbox_Wireless_Network_Simulation_Library
    # product.Component_Deployment_Guideline_for_Embedded_Coder
    # product.Computer_Vision_Toolbox_Interface_for_OpenCV_in_MATLAB
    # product.Computer_Vision_Toolbox_Interface_for_OpenCV_in_Simulink
    # product.Computer_Vision_Toolbox_Model_for_BiSeNet_v2_Semantic_Segmentation_Network
    # product.Computer_Vision_Toolbox_Model_for_Inflated-3D_Video_Classification
    # product.Computer_Vision_Toolbox_Model_for_Mask_R-CNN_Instance_Segmentation
    # product.Computer_Vision_Toolbox_Model_for_Object_Keypoint_Detection
    # product.Computer_Vision_Toolbox_Model_for_Pose_Mask_R-CNN_6-DoF_Object_Pose_Estimation
    # product.Computer_Vision_Toolbox_Model_for_R(2+1)D_Video_Classification
    # product.Computer_Vision_Toolbox_Model_for_RAFT_Optical_Flow_Estimation
    # product.Computer_Vision_Toolbox_Model_for_RTMDet_Object_Detection
    # product.Computer_Vision_Toolbox_Model_for_RetinaFace_Face_Detection
    # product.Computer_Vision_Toolbox_Model_for_SOLOv2_Instance_Segmentation
    # product.Computer_Vision_Toolbox_Model_for_SlowFast_Video_Classification
    # product.Computer_Vision_Toolbox_Model_for_Text_Detection
    # product.Computer_Vision_Toolbox_Model_for_Vision_Transformer_Network
    # product.Computer_Vision_Toolbox_Model_for_YOLO_v2_Object_Detection
    # product.Computer_Vision_Toolbox_Model_for_YOLO_v3_Object_Detection
    # product.Computer_Vision_Toolbox_Model_for_YOLO_v4_Object_Detection
    # product.Computer_Vision_Toolbox_OCR_Language_Data
    # product.Database_Toolbox_Interface_for_Neo4j_Bolt_Protocol
    # product.Databricks_ODBC_Driver_for_Database_Toolbox
    # product.Deep_Learning_Toolbox_Converter_for_ONNX_Model_Format
    # product.Deep_Learning_Toolbox_Converter_for_PyTorch_Model_Format
    # product.Deep_Learning_Toolbox_Converter_for_TensorFlow_models
    # product.Deep_Learning_Toolbox_Importer_for_Caffe_Models
    # product.Deep_Learning_Toolbox_Model_Compression_Library
    # product.Deep_Learning_Toolbox_Model_for_AlexNet_Network
    # product.Deep_Learning_Toolbox_Model_for_DarkNet-19_Network
    # product.Deep_Learning_Toolbox_Model_for_DarkNet-53_Network
    # product.Deep_Learning_Toolbox_Model_for_DenseNet-201_Network
    # product.Deep_Learning_Toolbox_Model_for_EfficientNet-b0_Network
    # product.Deep_Learning_Toolbox_Model_for_GoogLeNet_Network
    # product.Deep_Learning_Toolbox_Model_for_Inception-ResNet-v2_Network
    # product.Deep_Learning_Toolbox_Model_for_Inception-v3_Network
    # product.Deep_Learning_Toolbox_Model_for_MobileNet-v2_Network
    # product.Deep_Learning_Toolbox_Model_for_NASNet-Large_Network
    # product.Deep_Learning_Toolbox_Model_for_NASNet-Mobile_Network
    # product.Deep_Learning_Toolbox_Model_for_Places365-GoogLeNet_Network
    # product.Deep_Learning_Toolbox_Model_for_ResNet-101_Network
    # product.Deep_Learning_Toolbox_Model_for_ResNet-18_Network
    # product.Deep_Learning_Toolbox_Model_for_ResNet-50_Network
    # product.Deep_Learning_Toolbox_Model_for_ShuffleNet_Network
    # product.Deep_Learning_Toolbox_Model_for_VGG-16_Network
    # product.Deep_Learning_Toolbox_Model_for_VGG-19_Network
    # product.Deep_Learning_Toolbox_Model_for_Xception_Network
    # product.Deep_Learning_Toolbox_Verification_Library
    # product.Embedded_Coder_Support_Package_for_ARM_Cortex-M_Processors
    # product.Ephemeris_Data_for_Aerospace_Toolbox
    # product.Extended_Tire_Features_for_Vehicle_Dynamics_Blockset
    # product.FMU_Builder_For_Simulink
    # product.GUIDE_to_App_Designer_Migration_Tool_for_MATLAB
    # product.Geoid_Data_for_Aerospace_Toolbox
    # product.Hyperspectral_Imaging_Library_for_Image_Processing_Toolbox
    # product.Image_Acquisition_Toolbox_Support_Package_for_DCAM_Hardware
    # product.Image_Acquisition_Toolbox_Support_Package_for_OS_Generic_Video_Interface
    # product.Image_Processing_Toolbox_Image_Data
    # product.Image_Processing_Toolbox_Model_for_Segment_Anything_Model
    # product.Instrument_Control_Toolbox_Support_Package_for_National_Instruments_VISA_and_ICP_Interfaces
    # product.Instrument_Control_Toolbox_Support_Package_for_Rohde_Schwarz_VISA_Interface
    # product.Lidar_Toolbox_Model_for_PointNet++_Classification
    # product.Lidar_Toolbox_Model_for_RandLA-Net_Semantic_Segmentation
    # product.Lidar_Toolbox_Support_Package_for_Hokuyo_LiDAR_Sensors
    # product.Lidar_Toolbox_Support_Package_for_Ouster_Lidar_Sensors
    # product.Lidar_Toolbox_Support_Package_for_Velodyne_LiDAR_Sensors
    # product.MATLAB_Basemap_Data_-_bluegreen
    # product.MATLAB_Basemap_Data_-_colorterrain
    # product.MATLAB_Basemap_Data_-_grayland
    # product.MATLAB_Basemap_Data_-_grayterrain
    # product.MATLAB_Basemap_Data_-_landcover
    # product.MATLAB_Client_for_MATLAB_Production_Server
    # product.MATLAB_Coder_Interface_for_Deep_Learning_Libraries
    # product.MATLAB_Coder_Interface_for_Visual_Studio_Code_Debugging
    # product.MATLAB_Support_Package_for_Android_Sensors
    # product.MATLAB_Support_Package_for_Apple_iOS_Sensors
    # product.MATLAB_Support_Package_for_Arduino_Hardware
    # product.MATLAB_Support_Package_for_LEGO_MINDSTORMS_EV3_Hardware
    # product.MATLAB_Support_Package_for_Quantum_Computing
    # product.MATLAB_Support_Package_for_Raspberry_Pi_Hardware
    # product.MATLAB_Support_Package_for_USB_Webcams
    # product.MATLAB_Support_for_HEIF/HEIC_Image_Format
    # product.Machine_Learning_Pipelines_for_Statistics_and_Machine_Learning_Toolbox_(Beta)
    # product.Medical_Imaging_Toolbox_Interface_for_Cellpose
    # product.Medical_Imaging_Toolbox_Model_for_Medical_Segment_Anything_Model
    # product.Mixed-Signal_Blockset_Models
    # product.Modelscape_for_MATLAB
    # product.Multi-Version_Co-Simulation_for_Simulink
    # product.Powertrain_Blockset_Drive_Cycle_Data
    # product.RF_Blockset_Models_for_Analog_Devices_RF_Transceivers
    # product.ROS_Toolbox_Support_Package_for_TurtleBot-Based_Robots
    # product.Robotics_System_Toolbox_Offroad_Autonomy_Library
    # product.Robotics_System_Toolbox_Robot_Library_Data
    # product.Scenario_Builder_for_Automated_Driving_Toolbox
    # product.Signal_Processing_Toolbox_Support_Package_for_Linux_IIO_Devices
    # product.Simulink_Coder_Support_Package_for_BeagleBone_Blue_Hardware
    # product.Simulink_Coder_Support_Package_for_NXP_FRDM-K64F_Board
    # product.Simulink_Coder_Support_Package_for_NXP_FRDM-KL25Z_Board
    # product.Simulink_Coder_Support_Package_for_VEX_EDR_V5_Robot_Brain
    # product.Simulink_Support_Package_for_Android_Devices
    # product.Simulink_Support_Package_for_Arduino_Hardware
    # product.Simulink_Support_Package_for_LEGO_MINDSTORMS_EV3_Hardware
    # product.Simulink_Support_Package_for_Parrot_Minidrones
    # product.Simulink_Support_Package_for_Raspberry_Pi_Hardware
    # product.Streaming_Data_Framework_for_MATLAB_Production_Server
    # product.Text_Analytics_Toolbox_Model_for_BERT-Base_Multilingual_Cased_Network
    # product.Text_Analytics_Toolbox_Model_for_BERT-Base_Network
    # product.Text_Analytics_Toolbox_Model_for_BERT-Large_Network
    # product.Text_Analytics_Toolbox_Model_for_BERT-Mini_Network
    # product.Text_Analytics_Toolbox_Model_for_BERT-Small_Network
    # product.Text_Analytics_Toolbox_Model_for_BERT-Tiny_Network
    # product.Text_Analytics_Toolbox_Model_for_all-MiniLM-L12-v2_Network
    # product.Text_Analytics_Toolbox_Model_for_all-MiniLM-L6-v2_Network
    # product.Text_Analytics_Toolbox_Model_for_fastText_English_16_Billion_Token_Word_Embedding
    # product.Text_Analytics_Toolbox_Model_from_UDify_Data
    # product.Variant_Manager_for_Simulink
    # product.Vehicle_Dynamics_Blockset_Maneuver_Data
    # product.WINNER_II_Channel_Model_for_Communications_Toolbox
    # product.Wireless_Testbench_Support_Package_for_NI_USRP_Radios


    ########################################################################
    ## OPTIONAL FEATURES
    ########################################################################
    ##
    ## Uncomment the lines for the optional features you want to install or download.



    ########################################################################
    ## CHECKSUM
    ########################################################################
    ##
    ## NOTE: DO NOT edit this field. MathWorks uses this field to
    ## check the integrity of the input file. Changing the value
    ## of the checksum field invalidates this input file.

    ?checksum=UjIwMjVh
Process:
  - Processor: URLDownloader
    Arguments:
      url: 'https://www.mathworks.com/mpm/%MPM_ARCH%/mpm'
      prefetch_filename: True
  - Processor: com.github.mlbz521.SharedProcessors/FileMode
    Arguments:
      file_mode: 0755
      file_path: '%pathname%'
  - Processor: com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter
    Arguments:
      original_string: '%INSTALLER_INPUT%'
      return_variable: INSTALLER_INPUT
      string_to_replace: '#RECIPE_CACHE_DIR#'
      variable_to_use: RECIPE_CACHE_DIR
  - Processor: FileCreator
    Arguments:
      file_content: '%INSTALLER_INPUT%'
      file_mode: 0755
      file_path: '%RECIPE_CACHE_DIR%/downloads/installer_input.txt'
  - Processor: DownloadMATLABProcessor
    Arguments:
      mpm_path: '%pathname%'
      dl_version: '%DL_VERSION%'
      dl_products:  '%DL_PRODUCTS%'
      dl_archs: '%DL_ARCHS%'
      installer_input_file: '%RECIPE_CACHE_DIR%/downloads/installer_input.txt'
  - Processor: EndOfCheckPhase
