<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads and packages the latest specified patch verison of Matlab from a local file share.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.pkg.MatlabUpdate</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Matlab Patch</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.MatlabUpdate</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/scripts</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/ExtractWith7z</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%found_filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts</string>
				<key>purge_destination</key>
				<string>true</string>
				<key>7z_path</key>
				<string>%BINARY_7Z_PATH%</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
				<key>file_content</key>
				<string>#!/bin/bash

###################################################################################################
# Script Name:  Update-MatLab.sh
# By:  Zack Thompson / Created:  4/1/202021
# Version:  1.0.0 / Updated:  4/1/202021 / By:  ZT
#
# Description:  This script updates MatLab.
#
###################################################################################################

echo "*****  Update Matlab process:  START  *****"

##################################################
# Define Variables

# Set working directory
pkgDir=$( /usr/bin/dirname "${0}" )
# Version that's being updated (this will be set by the autopkg process)
version="%MAJOR_VERSION%"

##################################################
# Bits staged...

echo "Searching for existing Matlab instances..."
appPaths=$( /usr/bin/find -E /Applications -iregex ".*[/]MATLAB_R[0-9]{4}[ab][.]app" -type d -prune -maxdepth 1 )

# Verify that a Matlab version was found.
if [[ -z "${appPaths}" ]]; then

	echo "Did not find an instance Matlab!"
    exit 1

else

	# If the machine has multiple Matlab Applications, loop through them...
	while IFS=$'\n' read -r appPath; do

        if [[ "${appPath}" == *"${version}"* ]]; then

            echo "Updating Matlab version:  ${version}"
            exit_status=$( "${appPath}/bin/maci64/update_installer" -updatepackage "${pkgDir}/" )
            exit_code=$?

        fi

	done &lt; &lt;(echo "${appPaths}")

fi

if [[ $exit_code != 0 ]]; then
	echo "Exit Code:  ${exit_code}"
fi

if [[ $exit_status == *"End - Unsuccessful"* ]]; then
	echo "ERROR:  Update failed!"
	echo "ERROR Content:  ${exit_status}"
	echo "*****  Update Matlab process:  FAILED  *****"
	exit 2
fi

echo "Update complete!"
echo "*****  Update Matlab process:  COMPLETE  *****"
exit 0</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>version</key>
					<string>%version%</string>
					<key>id</key>
					<string>com.mathworks.updater</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>scripts</key>
					<string>Scripts</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
