Description: Downloads the latest version of GAUSS from a local file share.
Identifier: com.github.mlbz521.download.GAUSS
MinimumVersion: "2.3"
Input:
  NAME: GAUSS
  SEARCH_STRING: GAUSS
  MAJOR_VERSION: null
  NAME_LIMITATION: null
  NAME_EXCEPTION: testing
  FILE_SHARE: /path/to/offline/repository
  VERSION_STRING_SEPARATOR: "-"
  MAX_FOLDER_DEPTH: "1"
Process:
  - Processor: com.github.mlbz521.SharedProcessors/OfflineApps
    Arguments:
      search_path: "%FILE_SHARE%"
      search_string: "%SEARCH_STRING%"
      major_version: "%MAJOR_VERSION%"
      exception_string: "%NAME_EXCEPTION%"
      limitation_string: "%NAME_LIMITATION%"
      version_separator: "%VERSION_STRING_SEPARATOR%"
      max_depth: "%MAX_FOLDER_DEPTH%"
  - Processor: EndOfCheckPhase
  - Processor: FileFinder
    Arguments:
      pattern: "%cached_path%/*.pkg"
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%found_filename%"
      expected_authority_names:
        - "Developer ID Installer: Aptech Systems, Inc. (45URX5B6JY)"
        - Developer ID Certification Authority
        - Apple Root CA
