<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Cytoscape and creates a pkg.

Java 11 is *REQUIRED* to install Cytoscape.  If Java 11 is not pre-installed, the Cytoscape installer process should download and install Java itself.

Be aware the installation .app is NOT SIGNED.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.pkg.Cytoscape</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Cytoscape</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.Cytoscape</string>
    <key>Process</key>
    <array>
 		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/*.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/Cytoscape Installer.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash

###################################################################################################
# Script Name:  install_Cytoscape.sh
# By:  Zack Thompson / Created:  9/1/2020
# Version:  1.1.0 / Updated:  2/17/2021 / By:  ZT
#
# Description:  This script installs Cytoscape silently.
#
###################################################################################################

echo "*****  Install Cytoscape process:  START  *****"

if [[ $3 != "/" ]]; then
	echo "ERROR:  Target disk is not the startup disk."
	echo "*****  Install Cytoscape process:  FAILED  *****"
	exit 1
fi

# Remove previous versions
echo "Deleting previous versions of Cytoscape (if present)..."
/usr/bin/find "/Applications" -name "Cytoscape*" -type d -maxdepth 1 -exec rm -rfv {} \;

# Set working directory
pkgDir=$(/usr/bin/dirname "${0}")

# Get the name of the install .app in the directory
installApp=$(/bin/ls "${pkgDir}" | /usr/bin/grep .app)

# Install
echo "Installing Cytoscape..."
exitStatus=$( "${pkgDir}/${installApp}/Contents/MacOS/JavaApplicationStub" -q )
exitCode=$?

if [[ $exitCode == 0 ]]; then

	echo "Cytoscape has been installed!"

else

	echo "ERROR:  Failed to install Cytoscape"
	echo "ERROR Contents:  ${exitStatus}"
	echo "*****  Install Cytoscape process:  FAILED  *****"
	exit 2

fi

echo "*****  Install Cytoscape process:  COMPLETE  *****"

exit 0</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array/>
					<key>id</key>
					<string>org.cytoscape.%NAME%-%version%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>