<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Cytoscape.

Java 11 is *REQUIRED* to install Cytoscape.  If Java 11 is not pre-installed, the Cytoscape installer process should download and install Java itself.

Be aware the installation .app is NOT SIGNED.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.download.Cytoscape</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Cytoscape</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>cytoscape/cytoscape</string>
                <key>asset_regex</key>
                <string>.+macos.+</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
