<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of Set.A.Light 3D from Elixxier.

I have not attempted to license this in an programmatic way yet, so the result will need to be licensed manually.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.download.SetALight3D</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Set.A.Light 3D</string>
		<key>SEARCH_URL</key>
		<string>https://www.elixxier.com/downloader-s3-usa.php?mac=11</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SetALightURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>search_path</key>
				<string>%SEARCH_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
				<key>prefetch_filename</key>
				<true />
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: elixxier Software GmbH (7UZEFDC862)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/XarExtractSingleFile</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>file_to_extract</key>
				<string>*PackageInfo</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/StringRightSplitter</string>
			<key>Arguments</key>
			<dict>
				<key>string_to_split</key>
				<string>%extracted_file%</string>
				<key>split_on</key>
				<string>/</string>
				<key>occurrence</key>
				<integer>1</integer>
				<key>index</key>
				<integer>0</integer>
				<key>return_variable</key>
				<string>id_value</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/StringRightSplitter</string>
			<key>Arguments</key>
			<dict>
				<key>string_to_split</key>
				<string>%id_value%</string>
				<key>split_on</key>
				<string>/</string>
				<key>occurrence</key>
				<integer>1</integer>
				<key>index</key>
				<integer>-1</integer>
				<key>return_variable</key>
				<string>id_value</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/VersionSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>%id_value%</string>
				<key>index</key>
				<integer>2</integer>
				<key>old</key>
				<string>_</string>
				<key>new</key>
				<string> </string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/VersionSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>%version%</string>
				<key>index</key>
				<integer>1</integer>
				<key>old</key>
				<string>.pkg</string>
				<key>new</key>
				<string>.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/XPathParser</string>
			<key>Arguments</key>
			<dict>
				<key>xml_file</key>
				<string>%extracted_file%</string>
				<key>xpath</key>
				<string>.//bundle-version/bundle/[@path='./Applications/%version%']</string>
				<key>attribute_one</key>
				<string>CFBundleShortVersionString</string>
				<key>return_variable_attribute_one</key>
				<string>version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
