<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Set.A.Light 3D from Elixxier, creates a package, and uploads to the JPS.

I have not attempted to license this in an programmatic way yet, so the result will need to be licensed manually.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.SetALight3D</string>
	<key>Input</key>
	<dict>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>
		<key>NAME</key>
		<string>Set.A.Light 3D</string>
		<key>CATEGORY</key>
		<string>Creativity</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Cytoscape is an open source software platform for visualizing molecular interaction networks and biological pathways and integrating these networks with annotations, gene expression profiles and other state data.  Although Cytoscape was originally designed for biological research, now it is a general platform for complex network analysis and visualization.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>SetALight3D.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.SetALight3D</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>All `.jss` recipes have been deprecated and will no longer receive updates due to the sunset of JSSImporter as it will stop working in a future version of Jamf Pro.  Please consider switching your JSSImporter workflows to JamfUploader instead.  Details:  https://grahamrpugh.com/2022/02/16/jssimporter-jamf-pro-api-token-auth.html</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>