Description: Downloads the latest release of Set.A.Light 3D from Elixxier and creates a .pkg.

  I have not attempted to license this in an programmatic way yet, so the result will need to be licensed manually.
Identifier: com.github.mlbz521.pkg.SetALight3D
ParentRecipe: com.github.mlbz521.download.SetALight3D
MinimumVersion: "2.3"
Input:
  NAME: Set.A.Light 3D
Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
  - Processor: PathDeleter
    Arguments:
      path_list: "%RECIPE_CACHE_DIR%/extractedfile"
