<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.Anaconda</string>
	<key>Description</key>
	<string>Downloads the latest version of Anaconda CLI (.sh) installer, set permissions as executable, and creates a package, and uploads to the JSS.

Install path is set to:  /Users/Shared/anaconda2</string>
	<key>Input</key>
	<dict>
		<key>GROUP_TEMPLATE</key>
		<string>GroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>version</key>
		<string>%VERSION%</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>

		<key>GROUP_NAME</key>
		<string>%NAME%%PYTHON_MAJOR_VERSION%-Testing</string>

		<key>NAME</key>
		<string>Anaconda</string>
		<key>PYTHON_MAJOR_VERSION</key>
		<string>2</string>
		<key>CATEGORY</key>
		<string>Testing</string>
		<key>DESCRIPTION</key>
		<string>The open source Anaconda Distribution is the easiest way to do Python data science and machine learning.  It includes hundreds of popular data science packages and the conda package and virtual environment manager.  Conda makes it quick and easy to install, run, and upgrade complex data science and machine learning environments.</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/Anaconda.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.Anaconda</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%%PYTHON_MAJOR_VERSION%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%%PYTHON_MAJOR_VERSION%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_icon</key>
				<string>%ICON%</string>
				<key>self_service_description</key>
				<string>%DESCRIPTION%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
