<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of MiKTeX and creates a pkg.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.pkg.MiKTeX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MiKTeX</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.MiKTeX</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict/>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
