<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.mlbz521.pkg.XeroxPrintDriver</string>
    <key>Description</key>
    <string>Downloads and packages the latest Xerox package based on the override-able parameters:  model, download type, and OS Version.

model example:  'Workcentre 6515'
download types:  The download type desired; the provided string is searched in the web page.  Some examples are:
    - "macOS Print and Scan Driver Installer" (default)
    - "ICA Scan USB Driver"
    - "IMAC CA Scan USB Driver"
    - "TWAIN Scan Driver"
OS version:  
    - x11 (default)
    - 10_15
    - 10_14
    - 10_13
    - (older OS Versions should be supported, however the format changes; contact me for details if this is needed)


Tested both "macOS Print and Scan Driver Installer" and "ICA Scan USB Driver" to download and package successfully.
    </string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Xerox Print Drivers</string>
        <key>PKG_NAME</key>
        <string>Xerox Print Drivers (Universal)</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.mlbz521.download.XeroxPrintDriver</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.mlbz521.SharedProcessors/RenamePath</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>new_name</key>
                <string>%PKG_NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
