<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest verison of Bomgar Console from a local file share and then uploads it to a JPS.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.Bomgar Console</string>
	<key>Input</key>
	<dict>
	<key>GROUP_TEMPLATE</key>
	<string>SmartGroupTemplate.xml</string>
	<key>POLICY_TEMPLATE</key>
	<string>PolicyTemplate.xml</string>
	<key>POLICY_CATEGORY</key>
	<string>Testing</string>
	<key>package_notes</key>
	<string>Product of AutoPkg</string>
	<key>GROUP_NAME</key>
	<string>%NAME%-Testing</string>
	<key>NAME</key>
	<string>Bomgar Console</string>
	<key>CATEGORY</key>
	<string>Communication</string>
	<key>SELF_SERVICE_DESCRIPTION</key>
	<string>With the Bomgar Representative Console, IT support technicians are able to remotely support desktops, laptops, and mobile devices, allowing them to:
* Remotely view a customers' screen and control their mouse and keyboard
* Chat with end-users and other reps within the session
* Initiate a remote support session from a device without requiring the end-user to have pre-installed software or be on a pre-defined user list
* Simultaneously work on multiple sessions, and invite other reps into a session to collaborate and fix problems
* Access and support unattended desktops or laptops via Bomgar’s Jump Technology

Noe:  You must be provisioned an account before use.</string>
	<key>SELF_SERVICE_ICON</key>
	<string>Bomgar Console.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.Bomgar Console</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
