<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest verison of Bomgar Jump Client from a local file share and then uploads it to a JPS.

The name of the bundled application and the package will be named based on the NAME substituion variable.
	</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.BomgarJumpClient</string>
	<key>Input</key>
		<dict>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>
		<key>NAME</key>
		<string>Bomgar Jump Client</string>
		<key>CATEGORY</key>
		<string>Technical Support</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>The Bomgar Jump Client is an installable application that enables a technician to access your remote computer, regardless of your location, for support puroses.  The remote computer does not need to reside on a known, internal network.  Jump Clients are persistently connected, thus allowing a technican to provide support to systems on remote networks anywhere in the world.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Bomgar.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.BomgarJumpClient</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
