<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of QGIS.  Requires python.org Python 3 to be pre-installed - other distributions are not supported.

Supports either the latest release or Long Term (support) Release.  Override the key "RELEASE_TYPE" to specify which you need:
Latest Release = "pr"
Long Term (support) Release = "ltr"</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.download.QGIS</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>QGIS</string>
        <key>RELEASE_TYPE</key>
        <string>pr</string>
        <key>URL</key>
        <string>https://download.qgis.org/downloads/macos/qgis-macos-%RELEASE_TYPE%.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/QGIS*.app</string>
                <key>requirement</key>
                <string>identifier "org.qgis.qgis3" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4F7N4UDA22"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
