<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of QGIS.  Requires python.org Python 3.6 to be pre-installed - other distributions are not supported.

Supports major versions 3 and 2.  Override the key "QGIS_Major_Version" to specify which you need:
QGIS2 = OSX
QGIS3 = macOS

This probably isn't the best way to do it, but it's simple and works for now.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.download.QGIS</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>QGIS</string>
        <key>QGIS_MAJOR_VERSION</key>
        <string>macOS</string>
        <key>SEARCH_URL</key>
        <string>https://www.qgis.org/en/site/forusers/download.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;http\://qgis\.org/downloads/macOS/QGIS-%QGIS_MAJOR_VERSION%-(?P&lt;version&gt;[0-9.-]+)\.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
