<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of QGIS, creates a package, and uploads it to the JSS.

Supports either the latest release or Long Term (support) Release.  Override the key "RELEASE_TYPE" to specify which you need:
Latest Release = "pr"
Long Term (support) Release = "ltr"

Notes:  
- Pyhton 3.6+ is a prerequisite before installing QGIS 3 -- the created .pkg will hard fail if Python 3.6+ is not installed.
- The created .pkg will "uninstall" previous versions of QGIS.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.QGIS</string>
	<key>Input</key>
	<dict>
		<key>GROUP_TEMPLATE</key>
		<string>GroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>

		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>

        <key>NAME</key>
        <string>QGIS</string>
		<key>CATEGORY</key>
		<string>Testing</string>
		<key>DESCRIPTION</key>
		<string>QGIS is an Open Source Geographic Information System that allows you to create, edit, visualize, analyze and publish geospatial information.</string>
		<key>ICON</key>
		<string>QGIS.png</string>

        <key>RELEASE_TYPE</key>
        <string>pr</string>
        <key>SEARCH_URL</key>
        <string>https://www.qgis.org/en/site/forusers/download.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https\://qgis\.org/downloads/macos/qgis-macos-%RELEASE_TYPE%\.dmg)</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.QGIS</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_icon</key>
				<string>%ICON%</string>
				<key>self_service_description</key>
				<string>%DESCRIPTION%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
