Description: Downloads the latest version of GIMP for macOS.

  Downloads both the ARM and Intel builds.

  Based on the recipes in `hjuutilainen-recipes`.
Identifier: com.github.mlbz521.download.GIMP-Universal
MinimumVersion: "2.3"
Input:
  NAME: GIMP
  PKG_NAME: GIMP (Universal)
  ARM_ARCHITECTURE: arm64
  INTEL_ARCHITECTURE: x86_64
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.gimp.org/downloads/
      re_pattern: (?P<url>//download\.gimp\.org/gimp/v[0-9.]*/macos/gimp-(?P<version>[0-9.-]+)-%ARM_ARCHITECTURE%.+\.dmg)
  - Processor: URLDownloader
    Arguments:
      url: https:%url%
      prefetch_filename: True
  - Processor: EndOfCheckPhase
    Arguments:
      arm_path: "%pathname%"
      arm_version: "%version%"
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.gimp.org/downloads/
      re_pattern: (?P<url>//download\.gimp\.org/gimp/v[0-9.]*/macos/gimp-(?P<version>[0-9.-]+)-%INTEL_ARCHITECTURE%.+\.dmg)
  - Processor: URLDownloader
    Arguments:
      url: https:%url%
      prefetch_filename: True
  - Processor: EndOfCheckPhase
    Arguments:
      intel_path: "%pathname%"
      intel_version: "%version%"
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%arm_path%/GIMP*.app"
      requirement: identifier "org.gimp.gimp-2.10" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = T25BQ8HSJF
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%intel_path%/GIMP*.app"
      requirement: identifier "org.gimp.gimp-2.10" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = T25BQ8HSJF
  - Processor: EndOfCheckPhase
