<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest version of a specificied PhET Lab Simulations and then uploads it to a JPS.

This recipe creates a pseudo macOS application.

Currently supported:
    - Balloons and Buoyancy
</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.jss.PhETLabSimulations</string>
    <key>Input</key>
    <dict>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>
		<key>NAME</key>
        <string>%LAB_SIM%</string>
		<key>CATEGORY</key>
		<string>Teaching and Research</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.PhETLabSimulations</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.mlbz521.SharedProcessors/FindFileInSearchPath</string>
            <key>Arguments</key>
            <dict>
                <key>find_file</key>
				<string>/Resources/%png_icns_file_name%.png</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%lab_description%</string>
				<key>self_service_icon</key>
				<string>%path_to_found_file%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
