<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of a specified PhET Lab Simulation.

Currently supported:
    - Balloons and Buoyancy
</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.download.PhETLabSimulations</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>%LAB_SIM%</string>
        <key>LAB_SIM</key>
        <string></string>
        <key>SEARCH_PATTERN</key>
        <string>&lt;div class="sim-version" itemprop="version softwareVersion"&gt;Version (?P&lt;version&gt;[0-9\.]+)&lt;/div&gt;</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PhETLabSimulationsProcessor</string>
            <key>Arguments</key>
            <dict>
                <key>lab_sim</key>
                <string>%LAB_SIM%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%version_url%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%download_url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
