Description: Downloads the latest version of the Microsoft Office Reset package.  This is the _base_ package with *no options* selected.
Identifier: com.github.mlbz521.download.MicrosoftOfficeResetOptions
MinimumVersion: "2.3"

Input:
  NAME:  Microsoft Office Reset Options

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<url>\/download\/Microsoft_Office_Reset_(?P<version>.*?)\.pkg)
      url: https://office-reset.com/

  - Processor: URLDownloader
    Arguments:
      url: "https://office-reset.com/%url%"

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: Paul Bowden (QGS93ZLCU7)"
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: "%pathname%"

  - Processor: EndOfCheckPhase