<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads and packages the latest Canon driver package based on the override-able parameters:  model, OS Version, and download type.

MODEL:
	- example:  'imageRUNNER ADVANCE C7565i III'
OS_VERSION options:  
	- macOS Monterey v12.0:  MACOS_12 (default)
	- macOS Big Sur v11.0:  MACOS_11
	- macOS Catalina v10.15:  MACOS_10_15
	- macOS Mojave v10.14:  MACOS_10_14
	- macOS High Sierra v10.13:  MACOS_10_13
	- (older OS Versions, including Windows and Linux should be supported by the processor as well, see my Shared Processors README)
DOWNLOAD_TYPE options:
	- Recommended will download whatever option is in the "Recommended Driver(s)" section
		Note:  The "Recommended" driver may not be the *_latest_* driver
	- UFRII will download the latest UFRII optional driver
	- PS will download the latest PS optional driver
	- FAX will download the latest FAX optional driver
	- PPD will download the latest PPD optional driver
		Note:  The `com.github.mlbz521.pkg.CanonPrintDriver` recipe does not support the PPD file type

The download recipe requires the Selenium Library (https://www.selenium.dev/documentation/) and a browser driver to be supplied.
See the CanonPrintDriverProcessor section (https://github.com/autopkg/MLBZ521-recipes/blob/master/Shared%20Processors/ReadMe.md#canonprintdriverprocessor) in my Shared Processors README for more info.</string>
		<key>Identifier</key>
		<string>com.github.mlbz521.pkg.CanonPrintDriver</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Canon URFII Print Drivers</string>
		</dict>
		<key>ParentRecipe</key>
		<string>com.github.mlbz521.download.CanonPrintDriver</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>FileMover</string>
				<key>Arguments</key>
				<dict>
					<key>source</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
					<key>target</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
						<string>%RECIPE_CACHE_DIR%/extractedfile</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
