<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Canon driver package based on the override-able parameters:  model, OS Version, and download type.

MODEL:
	- example:  'imageRUNNER ADVANCE C7565i III'
OS_VERSION options:  
	- macOS Sonoma v14.0:  MACOS_14 (default)
	- macOS Ventura v13.0:  MACOS_13
	- macOS Monterey v12.0:  MACOS_12
	- macOS Big Sur v11.0:  MACOS_11_0
	- macOS Catalina v10.15:  MACOS_10_15
	- macOS Mojave v10.14:  MACOS_10_14
	- macOS High Sierra v10.13:  MACOS_10_13
	- (older OS Versions, including Windows and Linux should be supported by the processor as well, see my Shared Processors README)
DOWNLOAD_TYPE options:
	- Recommended will download whatever option is in the "Recommended Driver(s)" section
		Note:  The "Recommended" driver may not be the *_latest_* driver
	- UFRII will download the latest UFRII optional driver
	- PS will download the latest PS optional driver
	- FAX will download the latest FAX optional driver
	- PPD will download the latest PPD optional driver
		Note:  The `com.github.mlbz521.pkg.CanonPrintDriver` recipe does not support the PPD file type

The download recipe requires the Selenium Library (https://www.selenium.dev/documentation/) and a browser driver to be supplied.
See the CanonPrintDriverURLProvider section (https://github.com/autopkg/MLBZ521-recipes/blob/master/Shared%20Processors/ReadMe.md#CanonPrintDriverURLProvider) in my Shared Processors README for more info.</string>
		<key>Identifier</key>
		<string>com.github.mlbz521.download.CanonPrintDriver</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Canon URFII Print Drivers</string>
			<key>MODEL</key>
			<string>imageRUNNER ADVANCE C7565i III</string>
			<key>OS_VERSION</key>
			<string>MACOS_14</string>
			<key>WEB_DRIVER</key>
			<string>Chrome</string>
			<key>WEB_DRIVER_PATH</key>
			<string>/Library/AutoPkg/chromedriver</string>
			<key>WEB_DRIVER_BINARY_LOCATION</key>
			<string>/Applications/Chromium.app/Contents/MacOS/Chromium</string>
			<key>XPATH_PARSER_STRING</key>
			<string>jp.co.canon.CUPS(MF|PS|FAX\.)?(Printer|Installer).pkg</string>
			<key>DOWNLOAD_TYPE</key>
			<string>Recommended</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>com.github.mlbz521.SharedProcessors/CanonPrintDriverURLProvider</string>
				<key>Arguments</key>
				<dict>
					<key>model</key>
					<string>%MODEL%</string>
					<key>os_version</key>
					<string>%OS_VERSION%</string>
					<key>web_driver</key>
					<string>%WEB_DRIVER%</string>
					<key>web_driver_path</key>
					<string>%WEB_DRIVER_PATH%</string>
					<key>web_driver_binary_location</key>
					<string>%WEB_DRIVER_BINARY_LOCATION%</string>
					<key>download_type</key>
					<string>%DOWNLOAD_TYPE%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
					<key>prefetch_filename</key>
					<true />
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.mlbz521.SharedProcessors/ConditionalUnarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>purge_destination</key>
					<true />
					<key>find_extracted_file_pattern</key>
					<string>*.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%found_filename%/*.pkg</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.mlbz521.SharedProcessors/XarExtractSingleFile</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
					<key>file_to_extract</key>
					<string>Distribution</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.mlbz521.SharedProcessors/XPathParserRegEx</string>
				<key>Arguments</key>
				<dict>
					<key>xml_file</key>
					<string>%extracted_file%</string>
					<key>xpath_element</key>
					<string>product</string>
					<key>xpath_attribute_to_match</key>
					<string>id</string>
					<key>xpath_value_of_attribute_to_match</key>
					<string>%XPATH_PARSER_STRING%</string>
					<key>attribute_id_to_return</key>
					<string>version</string>
					<key>variable_to_assign_attribute_value</key>
					<string>version</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Canon Inc. (XE2XNRRXZ5)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
