<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Canon "Recommended Driver" package based on the override-able parameters:  model and OS Version.

model example:  'imageRUNNER ADVANCE C7565i III'
OS version options:  
	- macOS Big Sur v11.0:  MACOS_11_0 (default)
	- macOS Catalina v10.15:  MACOS_10_15
	- macOS Mojave v10.14:  MACOS_10_14
	- macOS High Sierra v10.13:  MACOS_10_13
	- (older OS Versions, including Windows and Linux should be supported by the processor as well, see my Shared Processors README)

The download recipe requires the Selenium Library (https://www.selenium.dev/documentation/) and a browser driver to be supplied.  See the CanonPrintDriverProcessor section (https://github.com/autopkg/MLBZ521-recipes/blob/master/Shared%20Processors/ReadMe.md#canonprintdriverprocessor) in my Shared Processors README for more info.
		</string>
		<key>Identifier</key>
		<string>com.github.mlbz521.jss.CanonPrintDriver</string>
		<key>Input</key>
		<dict>
			<key>GROUP_TEMPLATE</key>
			<string>GroupTemplate.xml</string>
			<key>POLICY_TEMPLATE</key>
			<string>PolicyTemplate.xml</string>
			<key>POLICY_CATEGORY</key>
			<string>%CATEGORY%</string>
			<key>package_notes</key>
			<string>Product of AutoPkg</string>
			<key>GROUP_NAME</key>
			<string>%NAME%-Testing</string>
			<key>NAME</key>
			<string>Canon URFII Print Drivers</string>
			<key>CATEGORY</key>
			<string>Testing</string>
			<key>SELF_SERVICE_DESCRIPTION</key>
			<string>Install Canon's UFRII Printer Drivers.  This driver package supports various models in Canon's imageRUNNER ADVANCE product line.</string>
			<key>SELF_SERVICE_ICON</key>
			<string>CanonPrinter.png</string>
		</dict>
		<key>ParentRecipe</key>
		<string>com.github.mlbz521.pkg.CanonPrintDriver</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>JSSImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>policy_category</key>
					<string>%POLICY_CATEGORY%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>self_service_description</key>
					<string>%SELF_SERVICE_DESCRIPTION%</string>
					<key>self_service_icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>%GROUP_NAME%</string>
							<key>smart</key>
							<true/>
							<key>template_path</key>
							<string>%GROUP_TEMPLATE%</string>
						</dict>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
