<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads and packages the latest verison of iManage Work from a local file share.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.pkg.iManageWork</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>iManage Work</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.iManageWork</string>
    <key>Process</key>
    <array>
 		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/XarExtractSingleFile</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/iManage Work.pkg</string>
				<key>file_to_extract</key>
				<string>Distribution</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/XPathParser</string>
			<key>Arguments</key>
			<dict>
				<key>xml_file</key>
				<string>%extracted_file%</string>
				<key>xpath</key>
				<string>.//pkg-ref[@id="com.iManage.iManageWorkForMac.pkg"][@version]</string>
				<key>attribute_one</key>
				<string>version</string>
				<key>return_variable_attribute_one</key>
				<string>version</string>
			</dict>
		</dict>
 		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/iManage Work.pkg</string>			
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>			
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/extractedfile</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
