<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of AutoCAD from a local file share.

Supports the new format found with AutoCAD 2021.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.download.AutoCAD</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AutoCAD</string>
		<key>SEARCH_STRING</key>
		<string>AutoCAD</string>
		<key>MAJOR_VERSION</key>
		<string></string>
		<key>NAME_LIMITATION</key>
		<string></string>
		<key>NAME_EXCEPTION</key>
		<string></string>
		<key>FILE_SHARE</key>
		<string>/path/to/offline/repository</string>
        <key>VERSION_STRING_SEPARATOR</key>
        <string>-</string>
		<key>MAX_FOLDER_DEPTH</key>
		<string>1</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>com.github.mlbz521.SharedProcessors/OfflineApps</string>
            <key>Arguments</key>
            <dict>
                <key>search_path</key>
                <string>%FILE_SHARE%</string>
                <key>search_string</key>
                <string>%SEARCH_STRING%</string>
                <key>major_version</key>
                <string>%MAJOR_VERSION%</string>
                <key>exception_string</key>
                <string>%NAME_EXCEPTION%</string>
                <key>limitation_string</key>
                <string>%NAME_LIMITATION%</string>
                <key>version_separator</key>
                <string>%VERSION_STRING_SEPARATOR%</string>
                <key>max_depth</key>
                <string>%MAX_FOLDER_DEPTH%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%cached_path%/*.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%found_filename%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%found_filename%/%app_name%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%app_name%</string>
				<key>overwrite</key>
				<string>true</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%app_name%</string>
				<key>requirement</key>
				<string>identifier "com.autodesk.AutoCAD%found_major_version%.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XXKJ396S2Y</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
