<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest verison of AutoCAD from a local file share and then uploads it to a JPS.

Supports the installer format found with AutoCAD 2020 and older.

The created Policy's name will be in the format of "%NAME% %MAJOR_VERSION%"</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.AutoCADLegacy</string>
	<key>Input</key>
	<dict>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>
		<key>NAME</key>
		<string>AutoCAD</string>
		<key>CATEGORY</key>
		<string>Creativity</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>AutoCAD is computer-aided design (CAD) software that architects, engineers, and construction professionals rely on to create precise 2D and 3D drawings.

* Draft, annotate, and design 2D geometry and 3D models with solids, surfaces, and mesh objects
* Automate tasks such as comparing drawings, addings blocks, creating schedules, and more</string>
		<key>SELF_SERVICE_ICON</key>
		<string>AutoCAD.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.AutoCADLegacy</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME% %found_major_version%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME% %found_major_version%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
