<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads and packages the latest verison of AutoCAD from a local file share.

Supports the new format found with AutoCAD 2021.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.pkg.AutoCAD</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AutoCAD</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.AutoCAD</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/scripts</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/%app_name%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/scripts/%app_name%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash

###################################################################################################
# Script Name:  install_AutoCAD.sh
# By:  Zack Thompson / Created:  9/2/2020
# Version:  1.2.0 / Updated:  8/24/2021 / By:  ZT
#
# Description:  This script silently installs AutoCAD 2021 and newer.
#
###################################################################################################

echo -e "*****  Install AutoCAD Process:  START  *****\n"

# Check the installation target.
if [[ $3 != "/" ]]; then
	echo "ERROR:  Target disk is not the startup disk."
	echo "*****  Install AutoCAD process:  FAILED  *****"
	exit 1
fi

##################################################
# Define Variables

# Set working directory
pkgDir=$( /usr/bin/dirname "${0}" )

# Get the filename of the .app file
AutoCADinstaller=$( /bin/ls "${pkgDir}" | /usr/bin/grep .app )

##################################################
# Define Functions

exitCheck() {
	if [[ $1 != 0 ]]; then

		echo "Failed to install:  ${2}"
		echo "Exit Code:  ${1}"
		echo "Reason:  ${3}"
		echo "*****  Install AutoCAD process:  FAILED  *****"
		exit 2

	else

		echo "${2} has been installed!"

	fi
}

##################################################
# Bits staged...

# "New" silent install method...that does not work when run in a cli installed .pkg (but does seem to work when installing that .pkg via GUI...)
# installResult=$( "${pkgDir}/${AutoCADinstaller}/Contents/Helper/Setup.app/Contents/MacOS/Setup" --silent --install_mode install --hide_eula  )

# Credit to Onkston for this install method.
# https://www.jamf.com/jamf-nation/discussions/35944/autocad-2021-deployment-with-network-server
pkgArray=$( /usr/bin/find -E "${pkgDir}/${AutoCADinstaller}/Contents/Helper/" -iregex ".*[/].*[.]pkg" -prune )

# Verify at least one version of SPSS was found.
if [[ -z "${pkgArray}" ]]; then

	exitCheck 3 "ERROR:  Unable to locate .pkgs in the expected location!"

else

	# Loop through each .pkg in the array.
	for pkg in "${pkgArray[@]}"; do

		echo "Installing ${pkg}..."
		installResult=$( /usr/sbin/installer -dumplog -verbose -pkg "${pkg}" -allowUntrusted -target / )
		exitCode=$?

		# Function exitCheck
		exitCheck $exitCode "${pkg}" "${installResult}"

	done

fi

echo "All components have been installed."
echo "AutoCAD has been installed!"
echo -e "\n*****  Install AutoCAD Process:  COMPLETE  *****"
exit 0</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array/>
					<key>id</key>
					<string>%bundleid%</string>
					<key>pkgname</key>
					<string>%NAME% %found_major_version%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
