<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Ricoh Driver package based on the override-able parameters:  model and OS Version.

model example:  'SP C830DN'
OS version options:  
	- latest
		- Setting the OS_VERSION key to latest will default to the latest version of macOS *supported by the Processor*
	- Ventura
	- Monterey
	- Big Sur
	- Catalina
	- Mojave
	- High Sierra
	- Sierra
	- (Windows and Linux could be supported by the processor with some tweaks, see my Shared Processors README)

The download recipe requires the Selenium Library (https://www.selenium.dev/documentation/) and a browser driver to be supplied.  See the RicohPrintDriverProcessor section (https://github.com/autopkg/MLBZ521-recipes/blob/master/Shared%20Processors/ReadMe.md#RicohPrintDriverProcessor) in my Shared Processors README for more info.
		</string>
		<key>Identifier</key>
		<string>com.github.mlbz521.pkg.RicohPrintDriver</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Ricoh Print Drivers</string>
		</dict>
		<key>ParentRecipe</key>
		<string>com.github.mlbz521.download.RicohPrintDriver</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>FileFinder</string>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%pathname%/*.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.mlbz521.SharedProcessors/StringRightSplitter</string>
				<key>Arguments</key>
				<dict>
					<key>string_to_split</key>
					<string>%dmg_found_filename%</string>
					<key>split_on</key>
					<string>_</string>
					<key>occurrence</key>
					<integer>1</integer>
					<key>index</key>
					<integer>-2</integer>
					<key>return_variable</key>
					<string>id_value</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.mlbz521.SharedProcessors/XarExtractSingleFile</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%/%dmg_found_filename%</string>
					<key>file_to_extract</key>
					<string>Distribution</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.mlbz521.SharedProcessors/XPathParser</string>
				<key>Arguments</key>
				<dict>
					<key>xml_file</key>
					<string>%extracted_file%</string>
					<key>xpath</key>
					<string>.//product[@id="com.Ricoh.print.%id_value%.pkg"]</string>
					<key>attribute_one</key>
					<string>version</string>
					<key>return_variable_attribute_one</key>
					<string>version</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%pathname%/*.pkg</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/extractedfile</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
