<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Ricoh Driver package based on the override-able parameters:  model and OS Version.

model example:  'Aficio SP C830DN'
OS version options:  
	- Big Sur
	- Catalina
	- Mojave
	- High Sierra
	- Sierra
	- (Windows and Linux could be supported by the processor with some tweaks, see my Shared Processors README)

The download recipe requires the Selenium Library (https://www.selenium.dev/documentation/) and a browser driver to be supplied.  See the RicohPrintDriverProcessor section (https://github.com/autopkg/MLBZ521-recipes/blob/master/Shared%20Processors/ReadMe.md#RicohPrintDriverProcessor) in my Shared Processors README for more info.
		</string>
		<key>Identifier</key>
		<string>com.github.mlbz521.jss.RicohPrintDriver</string>
		<key>Input</key>
		<dict>
			<key>GROUP_TEMPLATE</key>
			<string>GroupTemplate.xml</string>
			<key>POLICY_TEMPLATE</key>
			<string>PolicyTemplate.xml</string>
			<key>POLICY_CATEGORY</key>
			<string>%CATEGORY%</string>
			<key>package_notes</key>
			<string>Product of AutoPkg</string>
			<key>GROUP_NAME</key>
			<string>%NAME%-Testing</string>
			<key>NAME</key>
			<string>Ricoh Print Drivers</string>
			<key>CATEGORY</key>
			<string>Testing</string>
			<key>SELF_SERVICE_DESCRIPTION</key>
			<string>Installs Ricoh Printer Drivers.  This package supports various models in the following product lines:
  * Aficio SP Series
  * MP Series
  * Pro Series
			</string>
			<key>SELF_SERVICE_ICON</key>
			<string>Ricoh.png</string>
		</dict>
		<key>ParentRecipe</key>
		<string>com.github.mlbz521.pkg.RicohPrintDriver</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>JSSImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pkg_path%</string>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>policy_category</key>
					<string>%POLICY_CATEGORY%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>self_service_description</key>
					<string>%SELF_SERVICE_DESCRIPTION%</string>
					<key>self_service_icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>%GROUP_NAME%</string>
							<key>smart</key>
							<true/>
							<key>template_path</key>
							<string>%GROUP_TEMPLATE%</string>
						</dict>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
