<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the Screencast-O-Matic disk image.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.download.Screencast-O-Matic</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Screencast-O-Matic</string>
        <key>DOWNLOAD_URL</key>
        <string>https://screencast-o-matic.com/getappdownload?platform=mac</string>
    </dict>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Screencast-O-Matic has been rebranded as Screen Pal.  dataJAR has created a download reciepe for the new app, you can find it here:  github.com/autopkg/dataJAR-recipes/tree/master/Screen%20Pal%203</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.screencastomatic.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "48Z4QVLCS5"</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>