<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the Screencast-O-Matic disk image and builds a package.

The Screencast-O-Matic application (in my opinion) is poorly designed.  The user has to own .app for them to be able to launch it.

So....that said...That means only one user on any system can actually use this app.  I'm trying to get in contact them to figure this out.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.pkg.Screencast-O-Matic</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Screencast-O-Matic</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.Screencast-O-Matic</string>
    <key>Process</key>
    <dict>
        <key>Processor</key>
        <string>DeprecationWarning</string>
        <key>Arguments</key>
        <dict>
            <key>warning_message</key>
            <string>Screencast-O-Matic has been rebranded as Screen Pal.  dataJAR has created a .download reciepe for the new app, you can find it here:  github.com/autopkg/dataJAR-recipes/tree/master/Screen%20Pal%203.  I've also created a new .pkg recipe that's available in my repo under ../ScreenPal</string>
        </dict>
    </dict>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/scripts</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/*.app</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/%app_name%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>#!/bin/bash

###################################################################################################
# Script Name:  install_Screencast-O-Matic.sh
# By:  Zack Thompson / Created:  3/15/2019
# Version:  1.1.0 / Updated:  2/10/2022 / By:  ZT
#
# Description:  This script sets the console user as owner of the %app_name%.
#
###################################################################################################

echo "*****  PostInstall Script process:  START  *****"

if [[ $3 != "/" ]]; then
	echo "[ERROR] Target disk is not the startup disk."
	echo "*****  PostInstall Script process:  FAILED  *****"
	exit 1
fi

# Get current user
currentUser=$( /usr/sbin/scutil &lt;&lt;&lt; "show State:/Users/ConsoleUser" | 
    /usr/bin/awk '/Name :/ &amp;&amp; ! /loginwindow/ { print $3 }' )

# Check if the Screencast-O-Matic is currently installed...
if [[ -e "/Applications/%app_name%" ]]; then
	echo "Screencast-O-Matic is currently installed; giving the current console user ownership..."
    /usr/sbin/chown -R "${currentUser}" "/Applications/%app_name%"
fi

if [[ $( /usr/bin/stat -f "%Su" "/Applications/%app_name%" ) == "${currentUser}" ]]; then
    echo "Screencast-O-Matic has been installed!"
else
    echo "Failed to assign the proper permissions!"
    echo "Rolling back changes!"
    rm "/Applications/%app_name%"
    exit 2
fi

echo "*****  PostInstall Script process:  COMPLETE  *****"
exit 0</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>com.screencastomatic.app</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
