<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the Screencast-O-Matic disk image, builds a package, and uploads it to the JSS.

The Screencast-O-Matic application (in my opinion) is poorly designed.  The user has to own .app for them to be able to launch it.

So....that said...That means only one user on any system can actually use this app.  I'm trying to get in contact them to figure this out.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.jss.Screencast-O-Matic</string>
    <key>Input</key>
    <dict>
		<key>GROUP_TEMPLATE</key>
		<string>GroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>

		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>

        <key>NAME</key>
        <string>Screencast-O-Matic</string>
		<key>CATEGORY</key>
		<string>Testing</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Screencast-O-Matic is a screen capture tool.  This tool records a designated area of your screen as well as audio and webcam input.  You can use this tool to record narrated presentations or demonstrations and produce the recordings as videos for your courses.

Edit with the intuitive video editor.  Personalize your video with the robust suite of editing tools. It’s so easy to use that anyone can edit!  Start creating your videos by adding music and pictures, animations, overlays and more.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Screencast-O-Matic 2.png</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.Screencast-O-Matic</string>
    <key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>