Description: Downloads the latest version of the Insta360 Studio 2022 application and creates a .pkg.
Identifier: com.github.mlbz521.pkg.Insta360Studio2022
MinimumVersion: "2.3"
ParentRecipe: com.github.dataJAR-recipes.download.insta360studio2022
Input:
  NAME: Insta360 Studio 2022
Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: Deprecating this recipe as the parent has been deprecated.
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/expanded"
      flat_pkg_path: "%pathname%"
  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/expanded/Insta360_Studio_2022.pkg/Payload"
      purge_destination: true
  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/unpack/Insta360 Studio 2022.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString
  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
  - Processor: PathDeleter
    Arguments:
      path_list: 
        - "%RECIPE_CACHE_DIR%/expanded"
        - "%RECIPE_CACHE_DIR%/unpack"
