<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Parallels Desktop and creates a package, and uploads it to the JSS.  This recipe has been tested with major versions 9, 10, 11, 12, and 13.

This recipe uses my pkg recipe instead of homebysix's recipe..</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.Parallels Desktop</string>
	<key>Input</key>
	<dict>
		<key>GROUP_TEMPLATE</key>
		<string>GroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>VERSION</key>
		<string>%VERSION%</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>
		<key>package_info</key>
		<string>The package is unlicensed.  A license will need to be supplied after installation.</string>

		<key>BUNDLE_ID</key>
		<string>com.parallels.desktop.installer</string>
		<key>MAJOR_VERSION</key>
		<string>13</string>

		<key>NAME</key>
		<string>Parallels Desktop</string>
		<key>CATEGORY</key>
		<string>Utilities</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Parallels Desktop is a virtualization software that enables a Mac to run virtual Operating Systems and their applications within a native macOS environment.  The software integrates the guest operating system into macOS, allowing it to mimic native OS performance.  Guests include Apple's macOS, Microsoft Windows, Linux, Google's ChromeOS, Android, and more.</string>
		<key>os_requirements</key>
		<string>10.12.x,10.11.6,10.11.5,10.10.5</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.ParallelsDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>os_requirements</key>
				<string>%OS_REQUIREMENTS%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
