<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.mlbz521.pkg.MySQLCommunityServer</string>
	<key>Description</key>
	<string>Downloads the latest specified RELEASE of MySQL Community Server and creates a package.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MySQL Community Server</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.gerardkok.download.MySQLCommunityServer</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%/*.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
