Description: Downloads the latest version of ScreenPal 3 and creates a .pkg.
Identifier: com.github.mlbz521.pkg.ScreenPal3
MinimumVersion: "2.3"
ParentRecipe: com.github.dataJAR-recipes.download.ScreenPal 3
Input:
  NAME: ScreenPal 3
Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%pathname%/ScreenPal Setup.app/Contents/ScreenPal v3.0.app"
      bundleid: "com.screenpal.app.ScreenPal-Setup"


  # - Processor: PkgPayloadUnpacker
  #   Arguments:
  #     destination_path: "%RECIPE_CACHE_DIR%/unpack"
  #     pkg_payload_path: "%RECIPE_CACHE_DIR%/expanded/Insta360_Studio_2022.pkg/Payload"
  #     purge_destination: true
  # - Processor: Versioner
  #   Arguments:
  #     input_plist_path: "%RECIPE_CACHE_DIR%/unpack/Insta360 Studio 2022.app/Contents/Info.plist"
  #     plist_version_key: CFBundleShortVersionString
  # - Processor: PkgCopier
  #   Arguments:
  #     source_pkg: "%pathname%"
  #     pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
  # - Processor: PathDeleter
  #   Arguments:
  #     path_list: 
  #       - "%RECIPE_CACHE_DIR%/expanded"
  #       - "%RECIPE_CACHE_DIR%/unpack"
