Description: Downloads the latest version of ScreenPal 3 and creates a .pkg.
Identifier: com.github.mlbz521.pkg.ScreenPal3
MinimumVersion: "2.3"
ParentRecipe: com.github.dataJAR-recipes.download.ScreenPal 3
Input:
  NAME: ScreenPal 3
Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/extracted"
      purge_destination: "true"
  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/extracted/ScreenPal-app.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      purge_destination: "true"
  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/payload/ScreenPal.app/Contents/Info.plist"
  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
