Description: Downloads the latest version of ScreenPal 3 and creates a .pkg.
Identifier: com.github.mlbz521.pkg.ScreenPal3
MinimumVersion: "2.3"
ParentRecipe: com.github.dataJAR-recipes.download.ScreenPal 3
Input:
  NAME: ScreenPal 3
Process:
  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/ScreenPal Setup.app/Contents/ScreenPal v3.0.app/Contents/Info.plist"
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%pathname%/ScreenPal Setup.app/Contents/ScreenPal v3.0.app"
      bundleid: "com.screenpal.app.ScreenPal-Setup"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
