<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest version of Balloons and Buoyancy.
	
This recipe creates a pseduo macOS application.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.pkg.BalloonsAndBuoyancy</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Balloons and Buoyancy</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.BalloonsAndBuoyancy</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications/Balloons and Buoyancy.app/Contents/MacOS</key>
					<string>0775</string>
					<key>Applications/Balloons and Buoyancy.app/Contents/Resources</key>
					<string>0775</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Balloons and Buoyancy.app/Contents/MacOS/Balloons and Buoyancy.jar</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_DIR%/BalloonsAndBuoyancy.icns</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Balloons and Buoyancy.app/Contents/Resources/BalloonsAndBuoyancy.icns</string>
			</dict>
		</dict>

        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;!DOCTYPE plist PUBLIC &quot;-//Apple Computer//DTD PLIST 1.0//EN&quot; &quot;http://www.apple.com/DTDs/PropertyList-1.0.dtd&quot;&gt;
&lt;plist version=&quot;1.0&quot;&gt;
&lt;dict&gt;
	&lt;key&gt;CFBundleDevelopmentRegion&lt;/key&gt;
	&lt;string&gt;English&lt;/string&gt;
	&lt;key&gt;CFBundleExecutable&lt;/key&gt;
	&lt;string&gt;launcher&lt;/string&gt;
	&lt;key&gt;CFBundleIconFile&lt;/key&gt;
	&lt;string&gt;BalloonsAndBuoyancy.icns&lt;/string&gt;
	&lt;key&gt;CFBundleIdentifier&lt;/key&gt;
	&lt;string&gt;edu.colorado.phet.simulation.balloons-and-buoyancy&lt;/string&gt;
	&lt;key&gt;CFBundleInfoDictionaryVersion&lt;/key&gt;
	&lt;string&gt;6.0&lt;/string&gt;
	&lt;key&gt;CFBundleName&lt;/key&gt;
	&lt;string&gt;ProfileCreator&lt;/string&gt;
	&lt;key&gt;CFBundlePackageType&lt;/key&gt;
	&lt;string&gt;APPL&lt;/string&gt;
	&lt;key&gt;CFBundleShortVersionString&lt;/key&gt;
	&lt;string&gt;%version%&lt;/string&gt;
	&lt;key&gt;CFBundleSignature&lt;/key&gt;
	&lt;string&gt;xmmd&lt;/string&gt;
	&lt;key&gt;CFBundleVersion&lt;/key&gt;
	&lt;string&gt;%version%&lt;/string&gt;
	&lt;key&gt;NSAppleScriptEnabled&lt;/key&gt;
	&lt;string&gt;NO&lt;/string&gt;
&lt;/dict&gt;
&lt;/plist&gt;</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Balloons and Buoyancy.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>#!/bin/bash

# Get the scripts current directory
scriptDir="$( cd "$(dirname "$0")" >/dev/null 2>&amp;1 ; pwd -P )"

# Get the scripts parent directory
parentDir="$( /usr/bin/dirname "${scriptDir}" )"

APP_JAR="Balloons and Buoyancy.jar"
APP_NAME="Balloons and Buoyancy"

java -Xdock:name="${APP_NAME}" -Xdock:icon="${parentDir}/Resources/BalloonsAndBuoyancy.icns" -cp "${scriptDir};.;" -jar "${scriptDir}/$APP_JAR"</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Balloons and Buoyancy.app/Contents/MacOS/launcher</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>id</key>
					<string>edu.colorado.phet.simulation.balloons-and-buoyancy</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%version%</string>
                    <key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
