<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest version of Balloons and Buoyancy and then uploads it to a JPS.

This recipe creates a pseduo macOS application.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.jss.BalloonsAndBuoyancy</string>
    <key>Input</key>
    <dict>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>
		<key>NAME</key>
        <string>Balloons and Buoyancy</string>
		<key>CATEGORY</key>
		<string>Communication</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Experiment with a helium balloon, a hot air balloon, or a rigid sphere filled with different gases.  Discover what makes some balloons float and others sink.

Sample Learning Goals
* Determine what causes the the balloon, rigid sphere, and helium balloon to rise up or fall down in the box.
* Predict how changing a variable among P, V, T, and number influences the motion of the balloons.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Balloons and Buoyancy.png</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.BalloonsAndBuoyancy</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
