<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads and packages the latest verison Respondus' LockDown Browser Lab Edition.

The download recipe requires you to set your Institution ID and Lab Hash.

Because Repondus does silly things by expecting the licencing information in the file name, this does package inception so that the package name is a standard format.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.pkg.RespondusLockDownBrowserLabEdition</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Respondus LockDown Browser Lab Edition</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.nstrauss.download.RespondusLockDownBrowserLab</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*.pkg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/XarExtractSingleFile</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%found_filename%</string>
				<key>file_to_extract</key>
				<string>Distribution</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/XPathParser</string>
			<key>Arguments</key>
			<dict>
				<key>xml_file</key>
				<string>%extracted_file%</string>
				<key>xpath</key>
				<string>.//bundle-version/bundle</string>
				<key>attribute_one</key>
				<string>CFBundleShortVersionString</string>
				<key>return_variable_attribute_one</key>
				<string>version</string>
				<key>attribute_two</key>
				<string>id</string>
				<key>return_variable_attribute_two</key>
				<string>bundleid</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Scripts</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%found_filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>#!/bin/bash

###################################################################################################
# Script Name:  install_RespondusLockDownBrowser.sh
# By:  Zack Thompson / Created:  3/18/2020
# Version:  1.0.0 / Updated:  3/18/2020 / By:  ZT
#
# Description:  This script installs Respondus LockDown Browser.
#
###################################################################################################

echo "*****  Install Respondus LockDown Browser Process:  START  *****"

##################################################
# Define Variables

# Set working directory
pkgDir=$( /usr/bin/dirname "${0}" )
# Get the filename of the .pkg file
pkg=$( /bin/ls "${pkgDir}" | /usr/bin/grep .pkg )

##################################################
# Bits staged...

# Install pkg
echo "Installing..."
/usr/sbin/installer -dumplog -verbose -pkg "${pkgDir}/${pkg}" -target /
exitCode=$?
/bin/sleep 2

if [[ $exitCode != 0 ]]; then
	echo "ERROR:  Install failed!"
	echo "Exit Code:  ${exitCode}"
	echo "*****  Install Respondus LockDown Browser process:  FAILED  *****"
	exit 1
fi

echo "*****  Install Respondus LockDown Browser Process:  COMPLETE  *****"

exit 0</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>id</key>
					<string>%bundleid%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
					<string>%RECIPE_CACHE_DIR%/extractedfile</string>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
