<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest verison Respondus' LockDown Browser, configures the install package for the Lab Edition, and then uploads it to a JPS.

The download recipe requires you to set your Institution ID and the pkg recipe requires your Lab Hash.

Because Respondus does silly things by expecting the licensing information in the file name, this does package inception so that the package name is a standard format.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.RespondusLockDownBrowserLabEdition</string>
	<key>Input</key>
	<dict>
        <key>GROUP_TEMPLATE</key>
        <string>SmartGroupTemplate.xml</string>
        <key>POLICY_TEMPLATE</key>
        <string>PolicyTemplate.xml</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>package_notes</key>
        <string>Product of AutoPkg</string>
        <key>GROUP_NAME</key>
        <string>%NAME%-Testing</string>
        <key>NAME</key>
		<string>Respondus LockDown Browser Lab Edition</string>
        <key>CATEGORY</key>
        <string>Browsers</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>Respondus LockDown Browser is a custom browser that locks down the testing environment within Canvas.  After the LockDown Browser is launched, you will not be able to print, copy, go to another website, or access other applications.

*Please be aware*:  When an exam is started, you are locked into it until you submit it for grading.</string>
        <key>SELF_SERVICE_ICON</key>
        <string>LockDownBrowser.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.RespondusLockDownBrowserLabEdition</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>All `.jss` recipes have been deprecated and will no longer receive updates due to the sunset of JSSImporter as it will stop working in a future version of Jamf Pro.  Please consider switching your JSSImporter workflows to JamfUploader instead.  Details:  https://grahamrpugh.com/2022/02/16/jssimporter-jamf-pro-api-token-auth.html</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
