<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of VOSviewer.

Java is *REQUIRED* to open VOSviewer.  Amazon's Corretto JDK is not compatiable in my testing.</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.download.VOSviewer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VOSviewer</string>
        <key>SEARCH_URL</key>
        <string>https://www.vosviewer.com/download</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https\://www\.vosviewer\.com/download/.+\.zip).+(Download VOSviewer )(?P&lt;version&gt;[0-9.]+)( for Mac OS X systems)</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string> 
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%-%version%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>