<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.ProfileCreator</string>
	<key>Input</key>
	<dict>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>
		<key>NAME</key>
		<string>Profile Creator</string>
		<key>CATEGORY</key>
		<string>Technical Support</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Profile Creator is a macOS app that allows an admin to create standard or customized configuration profiles.  Through a user-friendly GUI, you can easly enable and configure only the desired preferences in just a few clicks along with the ability to directly see the results XML code.

For admins, this a very useful tool for quickly seeing what a profile will look like before it's created.  For those less familiar with configuration profiles, this provides a window into what's actually happening behind the scenes when configuring profile preferences.

Profile Creator Benefits:
  * An Easy-to-Use GUI with an XML View
  * Manage Individual Preferences
  * Manage Third-Party App Preferences w/o the Sleuthing
  * Open-source ProfileManifests Framework based on Apple's Manifest Format
  * Export Configuration Profiles in Both Profile &amp; MCX Styles
  * Preference Dependencies
  * Profile Code Signing
  * Import Profiles into MDM

For additional information and the user guide, see the [Profile Creator's Wiki](https://github.com/ProfileCreator/ProfileCreator/wiki).</string>
		<key>SELF_SERVICE_ICON</key>
		<string>ProfileCreator.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.neilmartin83.pkg.ProfileCreator</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
