<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads and packages the latest verison of Bomgar Jump Client from a local file share.

The name of the bundled application and the package will be named based on the NAME substituion variable.
	</string>
    <key>Identifier</key>
    <string>com.github.mlbz521.pkg.BomgarJumpClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Bomgar Jump Client</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.BomgarJumpClient</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>tmp</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.mlbz521.SharedProcessors/StringRightSplitter</string>
            <key>Arguments</key>
            <dict>
                <key>string_to_split</key>
                <string>%found_filename%</string>
                <key>split_on</key>
                <string>/</string>
                <key>occurrence</key>
                <integer>1</integer>
                <key>index</key>
                <integer>1</integer>
                <key>return_variable</key>
                <string>file_name</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%found_filename%</string>
				<key>destination_path</key>
				<string>%pkgroot%/tmp/%file_name%</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.mlbz521.SharedProcessors/StringRightSplitter</string>
            <key>Arguments</key>
            <dict>
                <key>string_to_split</key>
                <string>%version%</string>
                <key>split_on</key>
                <string>.</string>
                <key>occurrence</key>
                <integer>1</integer>
                <key>index</key>
                <integer>0</integer>
                <key>return_variable</key>
                <string>version</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>version</key>
					<string>%version%</string>
					<key>id</key>
					<string>%bundleid%</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>tmp</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
