<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.BrotherPrinter</string>
	<key>Description</key>
	<string>Downloads the Brother Printer Driver, Software Package, Utility, or Firmware specified, creates a package, and uploads it to the JPS.  Obviously some packages are compatible with different models, but I haven't been able to think of a way to specify this in the name without it being extremely long.  You will need to specify the model specifically for this to work, take a look at the examples below.

How to specify the Model:
 - MFC-J6935DW = mfcj6935dw
 - HL-L9200CDWT = hll9200cdwt
 - HL-L9310CDW = hll9310cdw

Specify which OS Version:
 - Catalina = 10060
 - Mojave = 10052
 - High Sierra = 10045
 - Sierra = 10030
 - El Capitan = 10018
 - Yosemite = 10006
 - Mavericks = 132

Type:
 - Full Driver &amp; Software Package = 583
 - Printer Driver = 10062
 - Scanner Driver = 10063
 - IPrint&amp;Scan Push Scan Tool = 10381
 - Internet FAX Install Tool = 78
 - Firmware Update Tool = 318

This probably isn't the best way to do it, but it works...</string>
	<key>Input</key>
	<dict>
		<key>GROUP_TEMPLATE</key>
		<string>GroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>

		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>

		<key>NAME</key>
		<string>Brother Printer</string>
		<key>CATEGORY</key>
		<string>Testing</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Installs Brother Print Drivers for the model:  %MODEL%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Brother.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.BrotherPrinter</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>