<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest or a specified verison of SPSS Statistics from a local file share.

Supports the new format found with SPSS v27.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.pkg.SPSSStatistics</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SPSS Statistics</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.SPSSStatistics</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/%filename%</string>	
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
			<key>Arguments</key>
			<dict>
			   <key>pkg_path</key>
			   <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
