<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest or a specified verison of a SPSS Statistics Patch from a local file share and then uploads it to a JPS.

The created Policy's name will be in the format of "SPSS Statistics %MAJOR_VERSION% Patch"

Two override variables are avilable to support the installation of SPSS:
	* INSTALL_JDK_CLI
		* A JDK is required to install SPSS silently; if one is not installed, you can provide a command 
			line command to acquire one through any method that is support in your environemnt
	* INSTALL_PROPERTIES
		* As the name suggests, this the "installer.properties" that allows you to customize the install
			of SPSS.  The available parameters are included; customize for your environment.

Do note that the postinstall script that "handles the upgrade" searches the /Applications folder for the version of 
SPSS being upgraded and will inject the path into the install.properties file so it does not need to be specified
in the INSTALL_PROPERTIES override variable below, which is described above.
	</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.SPSSStatisticsPatch</string>
	<key>Input</key>
	<dict>
		<key>CUSTOM_TRIGGER</key>
		<string>SPSS_Statistics_#MAJOR_VERSION#_Patch</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>
		<key>NAME</key>
		<string>SPSS Statistics Patch</string>
		<key>CATEGORY</key>
		<string>Analytics</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>This will update your current version of SPSS Statistics to the latest version.

IBM SPSS Statistics is an statistical analysis family of products that helps to address the entire analytical process, from planning and data collection to analysis, reporting and deployment.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>SPSSStatistics28.png</string>
		<key>package_priority</key>
		<string>12</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.SPSSStatisticsPatch</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>original_string</key>
				<string>%CUSTOM_TRIGGER%</string>
				<key>return_variable</key>
				<string>CUSTOM_TRIGGER</string>
				<key>string_to_replace</key>
				<string>#MAJOR_VERSION#</string>
				<key>variable_to_use</key>
				<string>found_major_version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>original_string</key>
				<string>%NAME%</string>
				<key>return_variable</key>
				<string>NAME</string>
				<key>string_to_replace</key>
				<string>Patch</string>
				<key>variable_to_use</key>
				<string>found_major_version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter</string>
			<key>Arguments</key>
			<dict>
				<key>original_string</key>
				<string>%NAME%</string>
				<key>return_variable</key>
				<string>NAME</string>
				<key>string_to_replace</key>
				<string>$</string>
				<key>replacement_string</key>
				<string>Patch</string>
				<key>append_space</key>
				<true />
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>All `.jss` recipes have been deprecated and will no longer receive updates due to the sunset of JSSImporter as it will stop working in a future version of Jamf Pro.  Please consider switching your JSSImporter workflows to JamfUploader instead.  Details:  https://grahamrpugh.com/2022/02/16/jssimporter-jamf-pro-api-token-auth.html</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
